{
  "filename": "20251015103137_20251016_105147.mp3",
  "transcript": "[00:00:00] 担当者: えっ、ちょっと資料と用意してないんですけど、あのー、えっと、薄緑環境じゃなかった、えっと、新AWSサーバーなんですけど、HTTPからHTTPSに、変更されるんですよ。なんで、ちょっとそれが終わったらちょっと関係者にちょっと周知しようかと思ってますので、ちょっとよろしくお願いし ます、というところですね。はい。もうそれが1点と、で、あとは、あのー、なんだっけ？サポートに質問一応投げとけました。あの、例の件。はい。えっとですね。\n[00:00:29] 担当者: えっと、ああ、なんだっけ？一応バックログに、えっと、貼っといたんですけど。\n[00:00:36] 担当者: あとですね、ちょっと言っとかなきゃいけないことがあって、あの、パスの件あったじゃないですか。パスってか、エラーが出る件。\n[00:00:41] 辻: ああ、はい、長すぎる、と、っていうやつですね。\n[00:00:44] 担当者: あ、そうそうそうそう。で、それ、あの、追加でそのパス長すぎんだけど、みたいな話をちょっと投げてた気満々でいたんだけど、でも送信ボタンを押し忘れちゃったらしくて、ちょっと昨日、昨日急遽押しましたっていう感じです。一応こういう形で投げときますた。あの、例の件は。\n[00:01:02] 担当者: 一応3環境やります、で、運用しようと思ってます。IDかぶってんだけど、なんかいい方があるって話と。あと標準的な運用方法、なんかあれば教えてくれと。\n[00:01:11] 辻: はい、そうですね。\n[00:01:13] 担当者: あんまり、あんまり期待せずにくるかなと。うーん、というちょっと質問投げてんですけど、っていう状況でございます。はい。\n[00:01:22] 辻: はい。\n[00:01:22] 担当者: で、あとは、ちょっとテスト設計がちょっとサボってた部分があったので、今一生懸命、あの、また着手し始めました。あのドクターサムライ関係のやつをやってるので、ま、ちょっとそこをでやってますと。作ってます。で、ドクターサムライのやつがですね、結構、あの、これ見えますかね？元々のこの作りがすごい複雑なんですよ。\n[00:01:44] 辻: ああ。はい。\n[00:01:45] 担当者: これね。で、何々が終わったら、こう、で、一応それを鑑みた形でフローを作ってるんですけど、あのー、ちょっと俺がやらかしてねえかってのがちょっと非常に不安ではあるんですけど、一応これ作ってますという形で、もしかしたら辻さんちょっとこれすいません確認して、って渡すかもしんないんで、よろしく。あの、お願いしますって感じです。あの、めんどくさそうなやつちょっと全部辻さんにお願いする気満々ではないんですけど、あの、ちょっと、泣きが、泣きが入るかもしれないですと、いう感じでございます。はい。\n[00:02:16] 担当者: そんな感じかな。ちょっと僕からは以上でございますね。はい。\n[00:02:19] 辻: はい。\n[00:02:20] 担当者: 辻さんの方から何かありますかね？\n[00:02:21] 辻: ほう、ですね。ちょっと昨日から、あの、本番環境の、方での確認をちょっとスタート、ちょっとしてみてたんですけど、あの、\n[00:02:30] 担当者: そうそうそうそう。\n[00:02:31] 辻: そうですね。あのトリマス、のコピーのところから、ま、ちょっと簡単なところからと思って、えっと、やってて、えっと、とりあえずは、\n[00:02:38] 担当者: これですね。はい。\n[00:02:39] 辻: はい、あの、今日、あの、エラーをポンポンと発生させて、ま、メールが届いてるかと思うんですけど、ここって、えっと、件名のところデブがついてるのはもうOKっていうのがなんかどっかでやり取りが、\n[00:02:51] 担当者: もういいです、いいです。\n[00:02:51] 辻: 大丈夫です。\n[00:02:52] 担当者: もうもういいです。あの、あの、いいです、いいです。あの、とっぱらおうかと思ったんですけど、もうちょっと、あの、今更とっぱろうと第3時なんで、あの、\n[00:03:00] 辻: もういい。\n[00:03:00] 担当者: はい。\n[00:03:01] 辻: いろんなところにありそうですよ。\n[00:03:03] 担当者: そうそうそう。はい。ま、最悪、あの、全部一通りテストだったら、あの、装置感っていうですね、貴重な手を使おうかと、いう、も、あります。あの、ちょっと、今更言えねえなっていう感じでございます。\n[00:03:14] 辻: はい、分かりました。じゃあ、雑魚のところはOKとして、ま、もうまもなく、えっと、とりあえずは終わりそうなんではい、続けて、まあ、えっと、新しい、ま、何にするかとか決めてないですけど、ま、ちょっととりあえずちょっと簡単なところからいこうかなと。\n[00:03:28] 担当者: そうですね。はい。\n[00:03:29] 辻: 分かりました。\n[00:03:30] 担当者: あ、で、そうそう。これ聞こうと思ったんですけど、あの、簡単に、あの、トリマス、の、値がちゃんと変わってるよねっていうのも見といてくださいっていう話をちょっとテスト設計に書いたんですけど、あの、簡単でいいんでちょっと見といていただけると嬉しいかなと思います。あの、名前とか、名前、住所、え、あとあれかな、代表者名とかがちゃんと変わってればOKなんで。はい。\n[00:03:49] 担当者: ちょっと見といていただけると嬉しいかなと思います。はい。\n[00:03:52] 辻: はい、承知しました。\n[00:03:53] 担当者: もう本当そのレベルでいいです。あの、これ、がっつりやる必要全くないです。あの、大丈夫です。もう脳死で大丈夫です。そうそう、言おうとして忘れてました。ちゃんとメモれって話ですよね。ちょっと話さなきゃいけないことね。うん。そうなんすよね。ちょっとね。ちょっと最近サボってます。申し訳ないです。はい。\n[00:04:11] 担当者: はい。\n[00:04:12] 辻: ということで。じゃあ、とりあえずは。\n[00:04:14] 担当者: あれっすからね。粛々とやっていただく形で。で、俺も粛々とこう、あの、テスト設計粛々とつくるしかないな。感じでやってます。\n[00:04:24] 辻: うん。今のところ、こういう別途作業っていうのは発生してないんで、はい。\n[00:04:28] 担当者: そうですね。はい。\n[00:04:30] 担当者: ですね。\n[00:04:31] 担当者: そうですね。\n[00:04:33] 担当者: で、ちょっと、まあ、まあ、並行してその運用設計どうするか、って話もちょっと考えなきゃいけないんですけど。うーん、ちょっとね、やっぱ、なんつ、なんだろうな。ま、ちょっと、なんつーんだろう、JMSESSに慣れすぎたっていうのもちょっと正直あるんですけど、ちょっとJMSESSとジョブセンターの、その、なんつーんだろうな、仕様が、こう、なんだろう、いけてない、いけてないんじゃないですかね。なんつーんだろう、こう、痒いところに、痒いとこってか、あの、JMSESSの融通が効いてたところを、\n[00:05:06] 辻: うんうんうん。\n[00:05:07] 担当者: あの、ジョブセンター全く、なん、切り捨てた感が俺ん中で印象あるんすよ。\n[00:05:13] 辻: ああ。そうですね。\n[00:05:15] 担当者: そうなんすね。ちょっとそこら辺がちょっと、うん、いやいや、なんだろうな、ちょっとやりづらいっていうのはちょっとあるかなと思うんすよね。で、あと、ま、大体繰り返して言ってるんですけど、ま、ちょっと辻さんに言ったかどうか分からないんですけど、ジョブセ、\n[00:05:30] 担当者: 殺せっかなって。あの、1月以降ですね、あの、ま、僕ら、僕らってか、あの、いじってる人たちは、まあまあ、しょうがねえなと思ってやってはいるんですけど。うーん、ちょっと、なーって、こう、うーん、ちょ、ちょっとなやましいなと思ってます。あの、なやましいなと思ってます。もうなやましいしか言えねえっすね。 あとあれだな、辻さんちょっと、あれだ、相談したかったことが、相談ってわけじゃないんですけど。あの、なんだろうな。\n[00:06:05] 担当者: ま、いっか。もう心の人なんて、ちょっとやっぱ、ちょっとしくってんですよ、やっぱ俺。 ま、なやましいよな。ま、いいんだろうけどな、既存の、やっぱ、ここ、なんつーだろうな、こう、こう、こういう風にやっぱ、なんだろう、ジョブセンター継承しちゃって、この貫通名とかでしてると、この処理が何してるかってよくわかんねえって。\n[00:06:24] 辻: ああああ。\n[00:06:25] 担当者: ちょっと、なん、なんで、ちょっとそこらへんいやらしいなってのちょっとあるんですけど、まあいっか。まあ、やぶらしゃねえだろうな。\n[00:06:32] 担当者: どちらかとこっちの方が分かりやすいんすよ。何がって。で、こっちにしちゃうと、うん、あ、これも分かりやすいんだけど、これなんだ、って。\n[00:06:39] 辻: うん。\n[00:06:40] 担当者: 調べなきゃいけないっていう、ちょっとめんどくささがまだあるんだけど、まあいっか、と。まあいっか、と。\n[00:06:44] 辻: パッと見分かんないっすね。\n[00:06:46] 担当者: 分かんないっす。\n[00:06:47] 担当者: ちょっとしくったな。もう、もうというかね。もうやってみて分かるっていう。 ま、ここもちょっとあれだな。超心にゆとりがあったらちょっとあの、治すかって話をしてたんですけど、今は超、超心にゆとりが全くないのって。\n[00:07:02] 辻: うん。\n[00:07:11] 担当者: はい。\n[00:07:12] 担当者: 一応あとこれか。ちょっと共有しとくと。こういう形で、あの、えっと、その、何の処理でエラーが出たかってたまに書いてる処理があったりするんですけど、これちょっとご認識の通り、同じ名前にするとこれ登録できないんで、区別するようにやった感じです。これ、感じで。\n[00:07:27] 辻: ああああ、はいはいはい。\n[00:07:28] 担当者: そうなんですよ。\n[00:07:30] 担当者: なんでちょっとそういうのが、ちょっと了見書であるのと、ま、それもちょっとな、ま、なんつーだろうな。なんかあれですよね。ヘルパー、で、ヘルパーってか、Excelのヘルパーでなんか管理してるところになるとやっぱボックス単位で1位になってる方が分かりやすいんですよね、これね。何の処理のあれだろうっていうのがあったりするんで、ま、そういうのもちょっと悩ましいなと思いながら、手はいるんですけど、ま、多分この異常メールとかメール送信っていうのは多分腐るほどあるんで、多分辻さんが苦労してるとだと思うんですけど。\n[00:07:59] 辻: はいはいはい。\n[00:08:00] 担当者: ま、ちょっとしょうがない。あとこれも、あそっか、言っとくとこれね、名前の長さもあったりするんすよ。\n[00:08:05] 辻: あ、そうなんすか。\n[00:08:06] 担当者: で、かつ、そうなんすよ。で、かつ、なんかね、あの、複合技っていうか、あの、個々の名前の長、長さ以外に、なんか処理として登録する時の名前の長さな上限があるらしくて。\n[00:08:18] 辻: ああ。\n[00:08:19] 担当者: ちょっとよく分かんないですけどね。だから下手に長いのにすると、長くてこう、掘り、何ていうか、深い処理。どんどん掘ってく処理とかにしとくと、あの、長すぎるって怒られるんすよ。\n[00:08:31] 辻: なるほど。\n[00:08:33] 担当者: そうなんすよ。そういう仕様も入ってるっていう、こう、ちょっといやらしいんすよね。だから内部的に多分持ってんだと思うんですけど、その、その多分上から多分足してくんでしょうね、この、ドンと、ピッピピッて。足した時に多分桁数を超えるんで、あの、キャパオーバーです、みたいな感じになんだと思うんですけど。ま、そういうのもちょっと前ちょっと課題として上がってて多分、この、なんだっけ？バックログにも書いた記憶はあるんですけどね。ま、そういう状況でございます。ま、ちょっと、あの、余談でしたという感じですね。はい。\n[00:09:07] 担当者: 終わりました。じゃ、ちょっと申し訳ないですけど辻さん、とりあえずは粛々とテストをよろしくお願いいたしますと。で、俺も粛々とあのテスト設計頑張ります、って感じなので。はい。\n[00:09:19] 担当者: はい。じゃあちょっと早いっすけど以上で終わろうかと思いますので、はい、じゃあすいません引き続きよろしくお願いいたします。じゃ、お疲れ様でした。\n[00:09:26] 辻: ありがとうございました。失礼します。\n[00:09:27] 担当者: ありがとうございます。失礼します。",
  "meeting_notes": "# 会議議事録\n\n## エグゼクティブサマリー\n-   **日時**: 2025/10/16 10:51\n-   **参加者**: 担当者, 辻\n-   **主要議題**: 新AWSサーバーのHTTPS化、パス長問題に関するサポート問い合わせ状況、ドクターサムライ関連のテスト設計進捗、本番環境でのテスト状況、およびJobCenterの運用設計における課題。\n-   **重要決定事項**:\n    *   新AWSサーバーのHTTPからHTTPSへの変更完了後、関係者へ周知する。\n    *   本番環境テストで発生するエラーメール件名の「デブ」表示は現状許容する。\n    *   辻氏がトリマスの値（名前、住所、代表者名）の簡易確認を実施する。\n\n## 主要な議題・トピック\n1.  **新AWSサーバーのHTTPS化と関係者周知**\n    *   **内容**: 新AWSサーバーにおけるHTTPからHTTPSへの変更作業が進行中であることが報告された。作業完了後、関係者へその旨を周知する予定。\n    *   **決定事項**: HTTPS化完了後、関係者へ周知する。\n    *   **重要なポイント**: システムのセキュリティ強化に伴う変更であり、スムーズな情報共有が求められる。\n\n2.  **パス長問題とサポートへの問い合わせ状況**\n    *   **内容**: パスが長すぎることによるエラー発生の件について、追加の詳細を添えてサポートへ問い合わせを送信した。以前、送信ボタンの押し忘れがあったため、昨日改めて送信したとのこと。問い合わせ内容には、3環境での運用方法、ID重複時の対応、標準的な運用方法が含まれる。\n    *   **決定事項**: サポートからの回答を待つ。\n    *   **重要なポイント**: 長期的な解決策と、運用上のベストプラクティスを模索している。\n\n3.  **ドクターサムライ関連テスト設計の進捗**\n    *   **内容**: テスト設計が遅延していたものの、現在「ドクターサムライ関係」のテスト設計に集中的に着手している。当該設計は非常に複雑であり、完成次第、辻氏にレビューを依頼する可能性があることが伝えられた。\n    *   **決定事項**: 担当者はドクターサムライ関連のテスト設計を進める。\n    *   **重要なポイント**: 複雑な設計のため、他者による確認が品質確保に不可欠。\n\n4.  **本番環境でのテスト状況とエラーメール件名**\n    *   **内容**: 辻氏より、本番環境でのテストを開始し、トリマスのコピーから着手しているとの報告があった。テスト中に発生したエラーによりメールが届いているが、その件名に「デブ」という表記があることについて確認があった。担当者からは、現状その表記は許容するとの回答があった。\n    *   **決定事項**: エラーメール件名の「デブ」表示は現状許容し、本番環境でのテストを継続する。\n    *   **重要なポイント**: 既存のシステム制約により、メール件名の変更が困難であるため、運用上の許容範囲が確認された。\n\n5.  **トリマスの値変更に関する簡易確認依頼**\n    *   **内容**: 担当者から辻氏に対し、トリマスの値（名前、住所、代表者名）が適切に更新されているか、簡易的な確認を行うよう依頼があった。詳細なテストは不要で、主要な項目に絞った確認で問題ないとのこと。\n    *   **決定事項**: 辻氏はトリマスの値変更（名前、住所、代表者名）の簡易確認を実施する。\n    *   **重要なポイント**: 効率的なテスト実施のために、確認範囲を絞り込む。\n\n6.  **運用設計におけるJobCenterの課題**\n    *   **内容**: JMSESSとJobCenterの比較において、JobCenterの仕様が運用設計上の課題となっていることが共有された。具体的には、JMSESSに比べてJobCenterは融通が利かず、処理名やエラー時の識別子が分かりにくい点が挙げられた。また、名前の長さ制限や、内部的な複合的な名前の長さ上限が存在することも、運用を複雑にしている原因となっている。\n    *   **決定事項**: 特になし（課題認識の共有に留まる）。\n    *   **重要なポイント**: JobCenterの仕様が現在の運用にボトルネックとなっており、将来的な改善策の検討が必要。\n\n## ユーザーの主要なアクション項目・コミットメント\n-   **担当者**: 新AWSサーバーのHTTPからHTTPSへの変更完了後、関係者へ周知する。 - **期限**: 変更完了次第\n-   **担当者**: ドクターサムライ関連の複雑なテスト設計を完了させる。 - **期限**: 未定\n-   **担当者**: パス長問題に関するサポートからの回答を追跡する。 - **期限**: 回答受領次第\n-   **辻**: 本番環境でのテスト（トリマスのコピーから）を継続する。 - **期限**: 未定\n-   **辻**: トリマスの値変更（名前、住所、代表者名）の簡易確認を実施する。 - **期限**: 未定\n-   **辻**: 担当者からのドクターサムライテスト設計レビュー依頼に対応する。 - **期限**: 依頼時\n\n## 決定事項サマリー\n-   新AWSサーバーのHTTPからHTTPSへの変更完了後、関係者へ周知する。\n-   本番環境テストで発生するエラーメール件名の「デブ」表示は現状許容する。\n-   辻氏により、トリマスの値（名前、住所、代表者名）の簡易確認を実施する。\n\n## 次回までの課題・懸念事項\n-   JobCenterの仕様（融通のなさ、処理名の分かりにくさ、名前の長さ制限）が運用設計に与える影響について引き続き検討が必要。\n-   ドクターサムライ関連の複雑なテスト設計の品質確保とレビュー体制の確立。\n-   パス長問題に関するサポートからの回答とその内容。\n\n## 備考・その他の重要な情報\n*   担当者は現在、遅延していたテスト設計に集中的に取り組んでおり、進捗回復に努めている。\n*   JMSESSとJobCenterの仕様比較におけるJobCenterの使いにくさについて、担当者から詳細な懸念が共有された。\n*   エラーメール件名に含まれる「デブ」表記は、現状での変更が困難であるため、テスト期間中は許容されることになった。",
  "meeting_date": "2025-10-16T10:51",
  "conditions": "",
  "timestamp": "2025-10-16T10:53:02.028967",
  "file_size": 3430944
}