{
  "filename": "20251015103137_20251016_093923.mp3",
  "transcript": "[00:00:00] 話者A: え、ちょっと資料とでをしてないんですけど、あの、えっと、薄緑環境じゃなかった。えっと、新AWSサーバーなんですけど、HTTPからHTTPSに変換されるんですよ。\n[00:00:12] 話者A: なんで、ちょっとそれが終わったら、ちょっと関係者に周知しようかと思ってますので、ちょっとよろしくお願いしますというところですね。\n[00:00:19] 話者A: はい。ま、それが1点と、で、あとはあの、なんだっけ？サポートに質問一応投げとけました。あの、例の件。\n[00:00:26] 話者A: はい。えっとですね。\n[00:00:29] 話者A: えっと、なんだっけ？一応バックログに貼っといたんですけど。\n[00:00:36] 話者A: あとですね、ちょっと言っとかなきゃいけないことがあって、あの、パスの件あったじゃないですか。パスってか、エラーが出る件。\n[00:00:41] 話者B: ああ、はい。長すぎるとっていうやつですね。\n[00:00:44] 話者A: あ、そうそうそうそう。\n[00:00:45] 話者A: で、それ、あの、追加でそのパス長すぎんだけどみたいな話をちょっと投げてる気満々でいたんだけど。\n[00:00:52] 話者A: で、も、送信ボタンを押し忘れてたらしくて、ちょっと昨日、昨日急遽押しましたっていう感じです。\n[00:00:58] 話者A: 一応こういう形で投げときます。あの、例の件は。\n[00:01:02] 話者A: 一応3環境やります。で、運用しようと思ってます。ID被ってんだけど、なんかいい方法があるって話と。\n[00:01:08] 話者A: あと標準的な運用方法をなんかあれば教えてくれと。\n[00:01:11] 話者B: はい、そうですね。\n[00:01:14] 話者A: あんまり、あんまり期待せずにくるかなと。\n[00:01:16] 話者A: うん、というちょっと質問投げてんですけど、っていう状況でございます。\n[00:01:21] 話者A: はい。\n[00:01:22] 話者A: で、あとは、ちょっとテスト設計がちょっとサボってた部分があったので、今一生懸命あの、また着手し始めました。\n[00:01:30] 話者A: あの、ドクターサムライ関係のやつをやってるので、ま、ちょっとそこをで、やってますと。作ってます。\n[00:01:36] 話者A: で、ドクターサムライのやつがですね、結構、あの、これ、見えますかね？元々のこの作りがすごい複雑なんですよ。\n[00:01:44] 話者B: ああ。\n[00:01:45] 話者B: はい。\n[00:01:46] 話者A: これね。で、何々が、終わったらこう、で、一応それを加味した形でフローを作ってるんですけど。\n[00:01:52] 話者A: あの、ちょっと俺がやらかしてねえかってのが非常に不安ではあるんですけど。一応これ、作ってますって感じで、もしかしたら辻さんちょっとこれ、すいません、確認してっていう話になるかもしれないんで、よろしくお願いします。\n[00:02:04] 話者A: あの、お願いしますっていう感じです。\n[00:02:06] 話者A: あの、めんどくさそうなやつちょっと全部辻さんにお願いする気満々ではないんですけど、あの、ちょっと、泣き、泣きが入るかもしれないです。\n[00:02:13] 話者A: はい。っていう感じでございます。\n[00:02:15] 話者A: はい。そんな感じかな。ちょっと僕からは以上でございますね。\n[00:02:18] 話者A: はい。\n[00:02:19] 話者A: じゃ、辻さんの方から何かありますかね？\n[00:02:21] 話者B: そうですね。ちょっと昨日からあの、本番環境の方での確認はちょっとスタート、ちょっとしてみてたんですけど。\n[00:02:28] 話者A: あの。\n[00:02:30] 話者A: そうそうそうそう。\n[00:02:31] 話者B: そうですね、あの、トリマスのコピーのところから、ま、ちょっと簡単なところからと思って、えっと、やってて、えっと、とりあえずは、はい、あの、今日、あの、エラーをポンポンと発生させて、ま、メール、メールが届いてるかと思いますけど。\n[00:02:45] 話者B: ここって、えっと、件名のところデブがついてるのはもうOKって言うのがなんかどっかでやり取りがあったような。\n[00:02:51] 話者A: もういいです、いいです。\n[00:02:52] 話者B: 大丈夫ですか？\n[00:02:52] 話者A: もう、もういいです。あの、あの、いいです、いいです。あの、取っ払おうかと思ったんですけど、もうちょっと、あの、今更取っ払うと大惨事なんで。\n[00:02:59] 話者B: そうですね。色んなところにありそうですね。\n[00:03:03] 話者A: はい、もう最悪、あの、全部一通りテスト終わったら、あの、装置感っていうですね、秘境な手を使おうかなっていう、あの、も、あります。\n[00:03:10] 話者A: あの、ちょ、ちょっと、今さら言えねえなっていう感じでございます。\n[00:03:14] 話者B: はい、分かりました。じゃあ、デゾのところOKとして。\n[00:03:17] 話者B: ま、もうまもなく、えっと、とりあえずは終わりそうなので、えっと、続けて、まあ、えっと、新しい、ま、何にするかは決めてないですけど、ま、ちょっととりあえずちょっと簡単なところから行こうかなと。\n[00:03:28] 話者A: そうですね。はい。\n[00:03:29] 話者A: わかりました。\n[00:03:30] 話者A: あ、で、そうそう。これ聞こうと思ったんですけど、あの、簡単にあの、トリマスの値がちゃんと変わってるよねってのを見ておいてくださいっていう話をちょっとテスト設計に書いたんですけど。\n[00:03:39] 話者A: あの、簡単でいいんで、ちょっと見といていただけると嬉しいかなと思います。あの、名前とか、名前、住所、え、あとあれかな、代表者名とかがちゃんと変わってればOKなんで。\n[00:03:49] 話者A: はい。ちょっと見といていただけると嬉しいかなと思います。\n[00:03:52] 話者B: はい。承知しました。\n[00:03:53] 話者A: あ、もう本当にそのレベルでいいです。あの、これ、がっつりやる必要全くないです。あの、大丈夫です。その法で全然大丈夫です。\n[00:04:00] 話者A: あ、そうそう。言おうと思ってたの忘れました。ちゃんとメモって話ですよね。ちょっと話さなきゃいけないことね。うん。\n[00:04:05] 話者A: そうなんすよ。ちょっとね。ちょっと最近サボってます。申し訳ないです。はい。\n[00:04:11] 話者A: はい。\n[00:04:12] 話者A: ということで。\n[00:04:13] 話者A: じゃあ、とりあえずはあれですかね。粛々とやっていただく形で。俺も粛々とこう、あの、テスト設計粛々とやるしかないんで。うん。感じでやってます。\n[00:04:24] 話者B: はい。今んとこ運用別途作業っていうのは発生してないんで。\n[00:04:28] 話者A: はい。そうですね。\n[00:04:30] 話者B: はい。\n[00:04:31] 話者A: そうですね。\n[00:04:33] 話者A: で、ちょ、ちょっ、まあ、まあ、並行してその運用設計どうするかはちょっと考えなきゃいけないんですけど。\n[00:04:39] 話者A: うん、ちょ、ちょっとね、やっぱ、なんか、なんだろうな。うん、ちょ、ちょっと、なんつうんだろうな、JMSSに慣れすぎたってのちょっと正直あるんですけど。\n[00:04:48] 話者A: ちょっとJMSSとジョブセンターのそのなんつうんだろうな、仕様がこう。\n[00:04:54] 話者A: なんだろう。いけてない。いけてないじゃないですか。なんつうんだろうな、こう、痒いところに、痒いところってか、あの、JMSSの融通が効いてたところを、ジョブセンター全く切り捨てた感が俺ん中で印象あるんですよ。\n[00:05:12] 話者B: ああ。\n[00:05:13] 話者A: なんで。\n[00:05:14] 話者B: そうですね。\n[00:05:15] 話者A: ちょっとそこら辺がちょっと、うん、いや、いや、なんだろうな、ちょっとやりづらいってのちょっとあるかなと思うんすよね。\n[00:05:22] 話者A: で、あと、ま、ま、だいたい繰り返しって言ってるんですけど、ま、ちょっと辻さんに言ったかどうか分かんないんですけど。\n[00:05:29] 話者A: ジョブセンターこれ攻めっかなって。\n[00:05:33] 話者A: あの、1月以降ですね。あの、ま、僕ら、僕らってか、あの、いじってる人たちはまあまあしょうがねえなと思ってやってはいるんですけど。\n[00:05:42] 話者A: うん、ちょっと、なあってこう、ちょっと、悩ましいなと思ってます。\n[00:05:48] 話者A: あの。悩ましいなと思ってます。\n[00:05:53] 話者A: 悩ましいしか言えねえっすっていうところですね。\n[00:05:55] 話者A: あとあれだな、辻さんちょっとあれだ、相談したかったことが、相談っていうわけじゃないんですけど。\n[00:06:02] 話者A: あの、なんだろうな。ま、いいか。\n[00:06:05] 話者A: 心のゆとりなんて、ちょっと、やっぱ、ちょっとしくってんす、やっぱ俺。\n[00:06:09] 話者A: ま、悩ましいよな。ま、いいんだろうけどな、既存の。\n[00:06:14] 話者A: やっぱ、こう、なんだろうな、こう、こういう風にやっぱり、なんだろう、ジョブセンター継承しちゃって、この貫通名とかでしてると、この処理が何してるかってよく分かんないっていう。\n[00:06:24] 話者B: ああ。\n[00:06:25] 話者A: ちょっと、なんで、ちょっと、そこら辺いらしいなってのちょっとあるんですけど、まあいいか。もう、もうやむなしだろうな。\n[00:06:32] 話者A: どちらかというとこっちの方が分かりやすいんですよ、何があって。で、こっちにしちゃうと、うん、これ分かりやすいんだけど、これなんだって。\n[00:06:38] 話者A: うん。調べなきゃいけないっていうめんどくささがあるんだけど、まあいいか、もういいか。\n[00:06:44] 話者B: パッと見わかんないですね。\n[00:06:46] 話者A: 分かんないですね。\n[00:06:47] 話者A: ちょっとしくったなと思って、よく、よく、やってみて分かったっていう。うん。\n[00:06:53] 話者A: ま、ここもちょっとあれだな、超、心のゆとりがあったらちょっと直すかって話してるんですけど、今は超、超心のゆとりが全くないんで。\n[00:07:02] 話者B: そうですね。\n[00:07:11] 話者A: はい。\n[00:07:12] 話者A: 一応あとこれか。ちょっと共有しとくと、こういう形で、あの、えっと、その何の処理でエラーが出たかって、たまに書いてる処理があったりするんですけど、これちょっとご認識の通り、同じ名前にするとこれ登録できないんで、区別できるようにやった感じですね、これ感じて。\n[00:07:26] 話者B: ああ、はいはいはい。\n[00:07:28] 話者A: そうなんすよ。\n[00:07:30] 話者A: なんか、ちょっと、そういうのがちょっと良しゅう書であるのと、ま、それもちょっとなあって、ま、ま、なんだろうな。\n[00:07:36] 話者A: なんか、あれっすよね。ヘルパーで、ヘルパーってか、Excelのヘルパーでなんか管理してるところやると、やっぱボックス単位で1位になってる方が分かりやすいんですよね、これね。何の処理のあれだろうってのがあったりするんで、ま、そうもちょっと悩ましいなと思いながらではいるんですけど、ま、多分この異常メールとかメール送信ってのが多分腐るほどあるんで、多分辻さんが苦労したやつだと思うんですけど。\n[00:07:59] 話者B: はいはい。うん。\n[00:08:00] 話者A: ちょっとしょうがないね。\n[00:08:01] 話者A: あとこれも、あ、そっかそっか、言っとくと、これ、名前の長さもあったりするんすよ。\n[00:08:04] 話者B: ああ、そうなんですね。\n[00:08:06] 話者A: で、かつ、そうなんすよ。で、かつ、なんかね、あの、複合技っていうか、あの、心の名前の長さ以外に、なんか処理として登録するときの名前の長さが上限があるらしくて。\n[00:08:18] 話者B: ああ。\n[00:08:19] 話者A: ちょっとよく分かんないですけどね。だから、下手に長いのにすると、長くてこう、なんだか深い処理、いや、どんどん掘ってく処理とかにしとくと。\n[00:08:28] 話者A: あの、長すぎるって怒られるんすよ。\n[00:08:31] 話者B: ああ、なるほど。\n[00:08:33] 話者A: そうなんすよ。そういう仕様も入ってるっていう、こう、ちょっとね、いらしいんすよね。\n[00:08:38] 話者A: だから、内部的に多分持ってんだと思うんですけど、その、その、多分上から多分足していくんですよね、この、ドンと、ぴぴぴって。足した時に多分桁数を超えるんで、あの、キャパオーバーですみたいな感じなんだと思うんですけど。\n[00:08:53] 話者A: ま、そういうのもちょっと前ちょっと課題として上がってて、多分、この、なんだっけ、バックログの方にも書いた記憶はあるんですけどね。\n[00:09:02] 話者A: ま、そういう状況でございます。\n[00:09:04] 話者A: ま、ちょっと、余談でしたという感じですね。\n[00:09:06] 話者A: はい。終わりました。\n[00:09:09] 話者A: じゃ、ちょっと申し訳ないですけど、辻さんとりあえずは粛々とテストをよろしくお願いしますと。で、俺も粛々とあの、テスト設計頑張りますっていう感じなので。\n[00:09:16] 話者A: はい。\n[00:09:18] 話者A: はい。じゃあ、ちょっと早いっすけど以上で終わろうかと思いますので。\n[00:09:22] 話者A: はい。じゃ、すいません、引き続きよろしくお願いいたします。\n[00:09:24] 話者A: じゃ、お疲れ様でした。\n[00:09:25] 話者B: ありがとうございました。\n[00:09:27] 話者A: ありがとうございます。失礼します。\n[00:09:28] 話者B: 失礼します。",
  "meeting_notes": "# 会議議事録\n\n## エグゼクティブサマリー\n- **日時**: 2025/10/16 09:39\n- **参加者**: 話者A, 辻さん (話者B)\n- **主要議題**: 新AWSサーバーのHTTPS変換の進捗と周知、システムサポートへの問い合わせ状況、ドクターサムライ関連のテスト設計、本番環境テストにおけるメール通知設定、およびJMSSからジョブセンターへの移行に伴う運用上の課題検討。\n- **重要決定事項**:\n    1.  新AWSサーバーのHTTPS変換完了後、関係者へ速やかに周知する。\n    2.  本番環境テストから発生するエラーメールの件名に「デブ」表記が残る現状は、既存システムへの影響を考慮し、変更せずに維持することを決定。\n    3.  辻さんは本番環境でのテストを継続し、特にトリマスの値変更の簡易確認を行う。話者Aは「ドクターサムライ」関連の複雑なテスト設計に注力し継続する。\n\n## 主要な議題・トピック\n1.  **新AWSサーバーのHTTPS変換と関係者周知**\n    *   **内容**: 新AWSサーバーがHTTPからHTTPSへの変換を予定している。変換作業が完了次第、関係者へその旨を周知する計画である。\n    *   **決定事項**: HTTPS変換完了後の関係者への周知。\n    *   **重要なポイント**: 環境のセキュリティ強化と安定稼働に向けた重要なステップ。\n\n2.  **システムサポートへの問い合わせ状況**\n    *   **内容**:\n        *   パスが長すぎることによるエラー発生の件について、追加でサポートに問い合わせを送信した（当初送信忘れがあったため、昨日急遽送信）。\n        *   バックログに記載されている、3環境でのID重複と標準的な運用方法に関する問い合わせも実施中。\n    *   **決定事項**: なし（状況報告であり、サポートからの回答待ち）。\n    *   **重要なポイント**: システム上の既知の課題（パス長制限、ID重複）に対する解決策の模索を継続。\n\n3.  **「ドクターサムライ」関連のテスト設計進捗**\n    *   **内容**: 遅れていたテスト設計について、「ドクターサムライ」関係の複雑なフローに着手し始めた。当該システムの元々の作りが非常に複雑であるため、話者Aは自身の設計の正確性に懸念を抱いており、必要に応じて辻さんに確認を依頼する可能性があることを伝えた。\n    *   **決定事項**: テスト設計の継続。必要に応じた辻さんへの設計内容確認依頼の検討。\n    *   **重要なポイント**: 複雑なシステムに対するテスト設計の正確性を確保することが最重要課題。\n\n4.  **本番環境でのテスト状況とエラーメール件名表記**\n    *   **内容**: 辻さんが本番環境での確認を開始し、簡単なテストを実施してエラーメールを発生させた。その際、エラーメールの件名に「デブ」と付くことについて、話者Aは「今更取っ払うと大惨事」になるとして、現状維持で問題ないとの見解を示した。\n    *   **決定事項**: エラーメール件名の「デブ」表記は現状維持とする。\n    *   **重要なポイント**: 既存システムの安定稼働を最優先し、広範囲に影響を及ぼす可能性のある軽微な表記変更は見送る方針。\n\n5.  **トリマスの値変更確認の依頼**\n    *   **内容**: 辻さんに対し、テストの一環として、トリマスの値（例: 名前、住所、代表者名など）が正しく更新されているかを簡単に確認するよう依頼した。詳細な検証は不要で、主要な項目のみの簡易確認で良いとのこと。\n    *   **決定事項**: 辻さんによるトリマスの値変更に関する簡易確認の実施。\n    *   **重要なポイント**: ユーザーデータに関する重要な変更が、基本的なレベルで正しく反映されているかのチェック。\n\n6.  **JMSSからジョブセンターへの移行に伴う運用設計と課題**\n    *   **内容**: JMSSからジョブセンターへの移行に伴う運用設計の検討が必要である。話者AはジョブセンターがJMSSに比べて「融通が利かない」と感じており、特に「貫通名」のような処理名が直感的でなく、処理内容の把握が難しいという課題を共有した。また、名前の長さ制限や、内部的な処理登録時の名前の長さ制限といった技術的な制約も運用を複雑にする要因として挙げられた。話者Aはこれらの課題に対し、将来的には改善したい意向があるが、現状では「心のゆとりがない」と述べた。\n    *   **決定事項**: なし（運用設計は継続検討。ジョブセンターの仕様に関する課題は長期的な懸念として認識）。\n    *   **重要なポイント**: 新システムへの移行における運用上の課題、システム仕様に起因する使いにくさ、および将来的な改善の必要性。\n\n## ユーザーの主要なアクション項目・コミットメント\n- **話者A**: 新AWSサーバーのHTTPS変換が完了次第、関係者へ周知する。 - **期限**: 変換完了後速やかに\n- **話者A**: 「ドクターサムライ」関連の複雑なテスト設計を継続し、完了させる。必要に応じて辻さんに設計内容の確認を依頼する可能性がある。 - **期限**: 未定（継続中）\n- **辻さん（話者B）**: 本番環境でのテスト（簡単なところから）を継続する。 - **期限**: 未定（継続中）\n- **辻さん（話者B）**: テスト作業と並行して、トリマスの値（名前、住所、代表者名など）が正しく変更されているか簡易的に確認する。 - **期限**: テスト作業と並行して\n\n## 決定事項サマリー\n- 新AWSサーバーのHTTPS変換完了後、関係者へ速やかに周知する。\n- 本番環境テストにおけるエラーメール件名の「デブ」表記は現状維持とする。\n- 辻さんによるトリマスの値変更の簡易確認を含むテストを継続し、話者Aはテスト設計を継続する。\n\n## 次回までの課題・懸念事項\n- 「ドクターサムライ」の複雑なテスト設計フローの正確性確保と、必要に応じた辻さんへの確認依頼の実施。\n- JMSSからジョブセンターへの移行に伴う運用設計の最適化、特にジョブセンターの分かりにくい名称（貫通名）および名前の長さ制限による運用上の制約への対応策の検討。\n- 話者Aによるテスト設計の確実な進捗（本人が「サボっていた」と認識している部分のリカバリー）。\n\n## 備考・その他の重要な情報\n- サポートへの問い合わせ（パス長、ID重複、標準運用）については現在回答待ちの状況である。\n- ジョブセンターの仕様に関する課題（名称の分かりにくさ、登録名の上限）は、長期的な運用改善の検討課題として認識されている。",
  "meeting_date": "2025-10-16T09:39",
  "conditions": "",
  "timestamp": "2025-10-16T09:41:00.489549",
  "file_size": 3430944
}