{
  "filename": "20251015103137_20251016_123514.mp3",
  "transcript": "[00:00:00] 話者A: ちょっと資料用意してないんですけど、あの、えっと、薄緑環境じゃなかった、えっと、新AWSサーバーなんですけど、HTTPからHTTPSにへんこうされるんですよ。なんで、ちょっとそれが終わったらちょっと関係者にちょっと周知しようかと思ってますので、ちょっとよろしくお願いします、っていうとこですね。はい。それは1点と。で、あとはあの、なんだっけ。サポートに質問一応投げとけました、あの例の件。\n[00:00:26] 佐鳥: はい。\n[00:00:27] 話者A: えっとですね。\n[00:00:29] 話者A: えっと、なんだっけ。一応バックログに貼っといたんですけど。\n[00:00:36] 話者A: あとですね、ちょっと言っとかなきゃいけないことがあって、あのパスの件あったじゃないですか。パスというかエラーが出る件。\n[00:00:41] 佐鳥: ああ、はい。長すぎるというやつですね。\n[00:00:44] 話者A: あ、そうそう、そうそう。で、それあの、追加でそのパス長すぎんだけど、みたいな話をちょっと投げてた気満々でいたんだけど、でも送信ボタンを押し忘れてたらしくて。ちょっと昨日、昨日急遽押しましたっていう感じです。一応こういう形で投げときます、あの例の件は。\n[00:01:02] 話者A: 一応3環境やります、で運用しようと思ってます、IDかぶってんだけど、なんかいい方がある、っていう話と、あと標準的な運用方法なんかあれば教えてくれと。\n[00:01:11] 佐鳥: はい、そうですね。\n[00:01:13] 話者A: あんま、あんまり期待せずにくるかなと。うーん、というちょっと質問投げてるところなんですけど。という状況でございます。はい。\n[00:01:22] 佐鳥: はい。\n[00:01:23] 話者A: で、あとはちょっとテスト設計はちょっとサボってた部分があったので、今一生懸命あの、また着手し始めました。あのDr.Sum関係のやつをやってるので、まあちょっとそこをでやってますと、作ってます。で、Dr.Sumのやつがですね、結構あの、これ見えますかね？元々のこの作りがすごい複雑なんですよ。\n[00:01:44] 佐鳥: ああ。はい。\n[00:01:45] 話者A: これね。で、何々が終わったらこうで、一応それを鑑みた形でフローを作ってるんですけど。あの、ちょっと俺がやらかしてねえかっていうのはちょっと非常に不安ではあるんですけど、一応これ作ってますって感じで、もしかしたら佐鳥さん、ちょっとこれすいません、確認してってお願いするかもしれないんで、よろしくお願いします。あの、お願いします、って感じです。\n[00:02:06] 佐鳥: はい。\n[00:02:07] 話者A: あの、めんどくさそうなやつはちょっと全部佐鳥さんにお願いする気満々ではないんですけど、あの、ちょっと泣きが入るかもしれないです、という感じでございます。はい。そんな感じかな。ちょっと僕からは以上でございますね。はい。\n[00:02:19] 佐鳥: はい。\n[00:02:20] 話者A: 佐鳥の方から何かありますかね？\n[00:02:21] 佐鳥: あ、そうですね。ちょっと昨日からあの、本番環境の方での確認はちょっとスタートちょっとしてみたんですけど、あの。\n[00:02:29] 話者A: そうそう、そうそう。\n[00:02:30] 佐鳥: そうですね。あの、取り回すのコピーのところから、まあちょっと簡単なところからと思って、えっと、やってて、えっと、とりあえずは。\n[00:02:38] 話者A: これっすね。はい。\n[00:02:39] 佐鳥: はい。あの、今日あのエラーをポンポンと発生させて、まあメールが届いてるかと 思うんですけど。ここって、えっと、件名のところDEVがついてるのはもうOKっていうのがなんかどっかでやり取りがあったので。\n[00:02:51] 話者A: もういいです、いいです。\n[00:02:51] 佐鳥: 大丈夫ですか？\n[00:02:52] 話者A: もう、もういいです。あの、あの、いいです、いいです。あの、取っ払おうかと思ったんですけど、もうちょっとあの、今更取っ払うと大惨事なんで、あの。\n[00:02:59] 話者A: そうそう、そうそう。\n[00:03:01] 佐鳥: いろんなところにありそうですね。\n[00:03:03] 話者A: そうそう、そうそう。まあ最悪、あの全部一通りテストだったら、あの、焼くというかですね、非常な手を使うかっていう案もあいます。あの、ちょ、ちょっと今更言えねえなっていう感じでございます。はい。\n[00:03:14] 佐鳥: はい、わかりました。じゃあ、そのままで、ここのところはOKとして、まあ、もう間もなく、えっと、とりあえずは終わりそうなので、えっと、続けて、まあ、えっと、新しい、ま、何にするかは決めてないですけど、ま、ちょっととりあえずちょっと簡単なところからいこうかなと。\n[00:03:28] 話者A: そうですね、はい。\n[00:03:29] 佐鳥: わかりました。\n[00:03:30] 話者A: あ、で、そうそう。これ聞こうと思ったんですけど、あの、簡単にあの取り回すの値がちゃんと変わってるよねっていうのも見といてくださいっていう話をちょっとテスト設計に書いてたんすけど。あの、簡単でいいんでちょっと見といていただけると嬉しいかなと思います。あの、名前とか、名前、住所、え、あとあれかな、代表者名とかがちゃんと変わってればOKなので、はい。ちょっと見といていただけると嬉しいかなと思います。はい。\n[00:03:52] 佐鳥: はい、承知しました。\n[00:03:53] 話者A: ま、ほんとそのレベルでいいです。あの、がっつりやる必要全くないです。あの。\n[00:03:58] 話者A: 大丈夫です。そのの。\n[00:04:00] 話者A: そうそう、言おうと思って忘れちまいました。ちゃんとメモれって話ですよね。ちょっと話さなきゃいけないことね。うん。そうなんすよ。ちょっとね、ちょっと最近サボってます。申し訳ないです。はい。\n[00:04:11] 話者A: はい。\n[00:04:12] 佐鳥: ということで。\n[00:04:12] 話者A: じゃ、とりあえずは。\n[00:04:15] 話者A: あれっすからね。粛々とやっていただく形で。で、俺も粛々とこう。あの、テスト設計粛々と書くしかない。\n[00:04:22] 話者A: 感じでやってます。\n[00:04:23] 佐鳥: うん。今んとこ、別途作業っていうのは発生してないんで。はい。\n[00:04:28] 話者A: そうすね、はい。\n[00:04:30] 佐鳥: 進めようかと。\n[00:04:31] 話者A: そうすね。\n[00:04:33] 話者A: で、ちょ、ちょっと、まあ、まあ、並行してその運用設計どうするか、って話もちょっと考えなきゃいけないんですけど。うん、ちょ、ちょっとね、やっぱ、なん、なんだろうな、ま、ちょっと、なんつうんだろうな、JMSSに慣れすぎたっていうの、ちょっと正直あるんですけど。ちょっとJMSSとジョブセンターのその、なんつうんだろうな、仕様がこう、なんだろう。いけてない、いけてないじゃなくて、なんつうんだろうな、こう。痒いところに、痒いとこというか、あの、JMSSの融通が効いてたところを。\n[00:05:06] 佐鳥: うん。うんうんうんうん。\n[00:05:07] 話者A: あの、ジョブセンター全く、なんだ、切り捨てた感が俺の中に印象あるんですよ。\n[00:05:12] 佐鳥: ああ。\n[00:05:13] 話者A: なんで。\n[00:05:14] 佐鳥: ああ、そうですね。\n[00:05:15] 話者A: ちょっとそこら辺がちょっと、うん、いや、いや、なんだろうな、ちょっとやりづらいっていうのはちょっとあるかなと思うんすよね。で、あと、まあ、ま、だいたい繰り返しって言ってるんですけど、ま、ちょっと佐鳥さんに言ったかどうか分かんないんですけど。ジョブセン、はい、これ押せっかなっていう。あの、1月以降ですね、あの。\n[00:05:35] 佐鳥: ああ。\n[00:05:36] 話者A: ま、僕ら、僕らというか、あの、いじってる人たちは、まあ、まあ、しょうがねえなと思ってやってはいるんですけど。\n[00:05:41] 佐鳥: はい。\n[00:05:42] 話者A: うん、ちょっと、なあって、こう。うん、ちょっと悩ましいなあと思ってます。あの。うん、悩ましいなと思ってます。もう悩ましいしか言えねえっすね。あと、あれだな、佐鳥さんちょっとあれだな、相談したかったことが、相談っていうわけじゃじゃないんですけど。あの、なんだろうな。ま、いっか。これ心にゆとりなんて、ちょっとやっぱちょっとしくってんですよね、やっぱ俺。ま、悩ましいよな。まあ、いいんだろうけどな、既存の。やっぱ、こう、なんつうんだろ、こう、こういう風にやっぱ、なんだろう、ジョブセンター継承しちゃって、この貫通名とかにしてると、この処理が何してるかよく分かんねえって。\n[00:06:24] 佐鳥: ああああ。\n[00:06:25] 話者A: ちょっと。なんで、ちょっと、そこら辺がいやらしいなっていうのはちょっとあるんですけど、まあ、いっか。まあ、やむなしだろうな。どちらかというとこっちの方が分かりやすいんですよ、何がって。で、こっちにしちゃうと、うん、あ、これも分かりやすいんだけど、これなんだ、って。\n[00:06:38] 佐鳥: うん。\n[00:06:39] 話者A: 調べなきゃいけないっていう、ちょっとめんどくささがなんだ、けど、まあ、いっか。まあ、いっか、と。\n[00:06:44] 佐鳥: パッと見分かんないですね。\n[00:06:46] 話者A: 分かんないですね。ちょっとしくったな、って。もう、もう手遅れ。もう、やってみて分かったっていうやつ。ま、ここもちょっとあれだな、超心にゆとりがあったらちょっと。\n[00:06:56] 佐鳥: ああ。\n[00:06:57] 話者A: あの、直すかって話なんだけど、今は超、超心にゆとりが全くないの。\n[00:07:02] 佐鳥: そうですね。\n[00:07:11] 話者A: はい。\n[00:07:12] 話者A: 一応あとこれか。ちょっと共有しとくと、こういう形で、あの。えっ、その、何の処理でエラーが出たかってたまに書いてる処理があったりするんですけど。これちょっとご認識の通り、同じ名前にするとこれ登録できないんで。区別するようにやった感じです、これって。\n[00:07:26] 佐鳥: ああ。はいはいはい。\n[00:07:28] 話者A: そうなんすよ。なんで、ちょっとそういうのがちょっと両思想であるのと。ま、それもちょっとなあ、て、ま、ま、なんだろうな。なんかあれっすよね。ヘルパー、ヘルパーというかExcelのヘルパーで。なんか管理してるところってやっぱボックス単位で。1位になってた方が分かりやすいんですよね、これね。何の処理のあれだろうってのがあったりするんで。ま、それもちょっと悩ましいなあと思いながら。ってはいいるんですけど。ま、多分この異常メールとかメール送信ってのが多分腐るほどあるんで、多分佐鳥さんが苦労してやるんだと思うんですけど。\n[00:07:59] 佐鳥: はいはい。\n[00:08:00] 話者A: ま、ちょっとしょうがねえ。あとこれもあ、そっか、言っとくとこれね、名前の長さもあったりするんすよ。\n[00:08:05] 佐鳥: あ、そうなんすね。\n[00:08:06] 話者A: でかつ、そうなんすよ。でかつ、なんかね、あの複合技というか、あのこの名前の長さ以外に、なんか処理として登録する時の名前の長さが上限があるらしくて。\n[00:08:18] 佐鳥: ああ。\n[00:08:19] 話者A: ちょっとよく分かんないですけどね。だから下手に長いのにすると、長くてこう、なんだ、深い処理、どんどん掘ってく処理とかにしとくと、長すぎるって怒られるんすよ。\n[00:08:31] 佐鳥: なるほど。\n[00:08:32] 話者A: そうなんすよ。そういう仕様も入ってるっていうね。こう。ちょっとね、いやらしいんすよね。だから内部的に多分持ってんだと思うんですけど、その。その多分上から多分足していくんでしょうね、このトントンぴっぴっぴって。足した時に多分桁数越えるんで、あのキャップ割れっす、みたいな感じになんだと思うんですけど。ま、そういうのもちょっと前ちょっと課題として上がってて多分、この。なんだっけ、バックログにも書いた記憶はあるんですけどね。ま、そういう状況でございます。ま、ちょっと余談でした、という感じですね。はい。終わりました。じゃ、ちょっと申し訳ないですけど、佐鳥さん、とりあえずは粛々とテストをよろしくお願いします。で、俺も粛々とあのテスト設計頑張りますって感じなので。\n[00:09:17] 佐鳥: はい。\n[00:09:18] 話者A: はい。はい。じゃ、ちょっと早いっすけど以上で終わろうかと思いますので、はい、じゃ、すいません、引き続きよろしくお願いいたします。じゃ、お疲れ様でした。\n[00:09:25] 佐鳥: ありがとうございました。\n[00:09:27] 話者A: ありがとうございます。失礼します。",
  "meeting_notes": "# 会議議事録\n\n## エグゼクティブサマリー\n- **日時**: 2025/10/15 10:30\n- **参加者**: 佐鳥（リーダー）、辻\n- **主要議題**: 新AWSサーバーHTTPS化の進捗、Dr.Sum関連のテスト設計、本番環境テストの状況確認、運用設計上の課題、エラー処理と命名規則に関する懸念。\n- **重要決定事項**:\n    - 新AWSサーバーのHTTPS化完了後、関係者へ速やかに周知する。\n    - 本番環境のエラーメール件名に「DEV」が付く件は現状維持とする。\n    - 佐鳥はテスト設計で指示された取り回しデータ値の簡易確認を実施する。\n\n## 主要な議題・トピック\n1.  **新AWSサーバーのHTTPS化と関係者周知**\n    -   **内容**: 新AWSサーバーがHTTPからHTTPSへ変更される予定であることが共有されました。現状、変更完了に向けた具体的な資料は準備中の段階です。\n    -   **決定事項**: HTTPS化が完了次第、関係者への周知を速やかに行う。\n    -   **重要なポイント**: 変更完了後のスムーズな情報共有が重要となる。\n\n2.  **パス長すぎ問題に関するサポートへの問い合わせ**\n    -   **内容**: 以前より懸念されていたパス長すぎ（またはエラー発生）問題について、サポート窓口への問い合わせが改めて送信されたことが報告されました（以前の送信忘れが発覚したため）。問い合わせ内容は以下の3点です：\n        *   3環境での運用方法\n        *   ID重複時の適切な対応方法\n        *   標準的な運用方法の有無\n    -   **決定事項**: なし（サポートからの回答待ち）。\n    -   **重要なポイント**: サポートからの回答内容に基づき、今後の運用方針を検討する必要がある。\n\n3.  **Dr.Sum関連のテスト設計進捗**\n    -   **内容**: Dr.Sum関連機能のテスト設計に着手したことが報告されました。当該機能の元々のシステム構造が非常に複雑であるため、フロー作成に難航しており、設計の正確性について不安があるとのことです。\n    -   **決定事項**: テスト設計を継続する。\n    -   **重要なポイント**: 設計の複雑性から、必要に応じて佐鳥氏にテスト設計内容の確認を依頼する可能性がある。\n\n4.  **本番環境でのテスト進捗とエラーメールの件名(DEV)に関する確認**\n    -   **内容**: 佐鳥氏より、昨日から本番環境でのテストを開始したことが報告されました。簡単な取り回しのコピー処理から着手しており、既に複数のエラーメールが発生していることを確認済みです。これらのエラーメールの件名に「DEV」が含まれている点について、現状維持で良いか佐鳥氏から確認がありました。\n    -   **決定事項**: エラーメール件名の「DEV」表記は、現状のままで運用を継続する。今更変更すると他の広範な箇所に影響が出るため、当面は変更しない方針です。\n    -   **重要なポイント**: 将来的な一括修正の可能性は示唆されたものの、現状の運用体制では変更が困難である。\n\n5.  **取り回しデータ値変更の簡易確認**\n    -   **内容**: テスト設計において、取り回しデータ（具体的には名前、住所、代表者名など）の値が正しく変更されているかの確認がタスクとして含まれていることが言及されました。\n    -   **決定事項**: 佐鳥氏が、主要な項目（名前、住所、代表者名）に限定し、値変更が適切に反映されているかについて簡易的な方法で確認を実施する。\n    -   **重要なポイント**: 詳細かつ広範な確認は不要であり、主要項目における変更確認で十分である。\n\n6.  **運用設計における課題（JMSSとジョブセンターの比較）**\n    -   **内容**: 運用設計を進めるにあたり、旧システム（JMSS）と新システム（ジョブセンター）の仕様の違いが大きな課題となっていることが共有されました。特に、ジョブセンターはJMSSに比べて融通が利かない点や、処理の命名規則・継承関係が複雑で、処理内容の把握が困難である点が挙げられました。1月以降のジョブセンター本格運用に対する懸念も示されました。\n    -   **決定事項**: なし（引き続き検討が必要）。\n    -   **重要なポイント**: ジョブセンターの仕様に起因する運用上の課題が認識されており、長期的な視点での運用改善や工夫が求められる。現状、抜本的な対応はリソース的に難しい状況である。\n\n7.  **エラー処理の命名規則と名称長制限の課題**\n    -   **内容**: エラー処理において、同じ処理名が登録できないため、処理ごとに区別して命名する必要があることが説明されました。また、Excelヘルパー等で管理する際には、ボックス単位で一意のIDが付与されている方が分かりやすいという意見が出ました。さらに、処理名には長さ制限があり、階層が深い処理では名前が長すぎて登録できない、またはエラーとなる複合的な問題が発生していることが指摘されました。この課題は以前からバックログにも記載されています。\n    -   **決定事項**: なし（引き続き検討が必要）。\n    -   **重要なポイント**: 命名規則の課題と名称長制限が、処理の可読性と運用の複雑さを増大させているため、将来的な改善策を検討する必要がある。\n\n## ユーザーの主要なアクション項目・コミットメント\n-   **辻**: 新AWSサーバーのHTTPS化完了後、関係者へ速やかに周知する - **期限**: HTTPS化完了後、速やかに\n-   **辻**: Dr.Sum関連のテスト設計を継続し、必要に応じて佐鳥に確認を依頼する - **期限**: (記載なし)\n-   **佐鳥**: 本番環境でのテスト（取り回しのコピー等）を継続する - **期限**: (記載なし)\n-   **佐鳥**: テスト設計に記載された取り回しデータ値の変更（名前、住所、代表者名）が反映されているか簡易的に確認する - **期限**: (記載なし)\n-   **辻**: 運用設計の課題（JMSSとジョブセンターの比較、命名規則）について検討・対応を継続する - **期限**: (記載なし)\n\n## 決定事項サマリー\n-   新AWSサーバーのHTTPS化完了後、関係者に周知することを決定した。\n-   本番環境のエラーメール件名に「DEV」が含まれる件は現状維持で問題ないと判断した。\n-   佐鳥はテスト設計で指示された取り回しデータ値の簡易確認を実施する。\n\n## 次回までの課題・懸念事項\n-   運用設計におけるJMSSとジョブセンターの仕様の違いによる複雑性と、それによって生じる処理の分かりにくさの解消に向けた検討。\n-   エラー処理の命名規則および名称長制限に関する根本的な解決策の検討。\n-   複雑なDr.Sum関連のテスト設計を適切に進めるための工夫と、必要に応じた関係者との連携。\n\n## 備考・その他の重要な情報\n-   パス長すぎ問題に関してサポートへの問い合わせは完了しており、現在回答を待っている状況である。\n-   辻はDr.Sum関連のテスト設計について過去の遅延を認めつつも、現在集中して取り組んでいる。\n-   現時点では、佐鳥の担当範囲で別途発生している作業はない。\n-   運用設計における命名規則の改善は必要と認識されているが、現状はリソースの制約により抜本的な対応は難しい。",
  "meeting_date": "2025-10-15T10:30",
  "conditions": "サミーのDBアップデートプロジェクト　APPチームのリーダーフォローの進捗確認会です\r\n参加者は佐鳥（リーダー）、辻",
  "timestamp": "2025-10-16T12:36:52.635510",
  "file_size": 3430944
}