{
  "filename": "20251015103137_20251016_110521.mp3",
  "transcript": "[00:00:00] 担当者: ちょっと資料を投影してないんですけど、あの、えっと、薄緑環境じゃなかった、えっと、新AWSサーバーなんですけど、HTTPからHTTPSに、変更されるんですよ。\n[00:00:12] 担当者: なんで、ちょっとそれが終わったらちょっと関係者に周知しようかと思ってますので、ちょっとよろしくお願いし ます、というところですね。はい。\n[00:00:19] 担当者: ま、それが一点と、で、あと、あの、なんだっけ？\n[00:00:23] 担当者: サポートに質問一応投げとけました。あの、例の件。\n[00:00:26] 担当者: えっとですね。\n[00:00:29] 担当者: えっと、なんだっけ？一応バックログに、えっと、貼っといたんですけど。\n[00:00:36] 担当者: あとですね、ちょっと言っとかなきゃいけないことがあって、あの、パスの件あったじゃないですか。パスっていうか、エラーが出る件。\n[00:00:41] 辻: ああ、はい。長すぎるとっていうやつですね。\n[00:00:44] 担当者: あ、そうそうそうそう。で、それ、あの、追加でそのパス長すぎんだけど、みたいな話を、ちょっと投げる気満々でいたんだけど、でも送信ボタンを押し忘れちらしくて。\n[00:00:55] 担当者: ちょっと昨日、昨日急遽押しましたっていう感じです。一応こういう形で投げときました。あの、例の件は。\n[00:01:02] 担当者: 一応3環境やります、で、運用しようと思ってます。IDかぶってんだけど、なんかいい方あるって話と。\n[00:01:08] 担当者: あと標準的な運用方法をなんかあれば教えてくれと。\n[00:01:11] 辻: はい、そうですね。\n[00:01:13] 担当者: あまり、あまり期待せずに降るかなと。\n[00:01:17] 担当者: うーん、というちょっと質問投げてんですけど、っていう状況でございます。\n[00:01:21] 担当者: はい。\n[00:01:22] 辻: はい。\n[00:01:22] 担当者: で、あとは、ちょっとテスト設計がちょっとサボってた部分があったので、今一生懸命、あの、また着手始めました。あのドクターサムラ関係のやつをやってるので、ま、ちょっとそこ でやってますと。作ってますと。\n[00:01:36] 担当者: で、ドクターサムラやつがですね、結構、あの、これ見えますかね？元々のこの作りがすごい複雑なんですよ。\n[00:01:44] 辻: ああ。はい。\n[00:01:45] 担当者: これね。で、何々が終わったらこうで、一応それを鑑みた形でフローを作ってるんですけど。\n[00:01:52] 担当者: あの、ちょっと俺がやらかしてねえかっていうのがちょっと非常に不安ではあるんですけど、一応これ作ってますという感じで、もしかしたら辻さんちょっとこれすいません、確認してって頼むかもしれないんで、よろしくしょ。\n[00:02:04] 担当者: あの、お願いします、って感じ。\n[00:02:06] 担当者: あの、めんどくさそうなやつ、ちょっと全部辻さんにお願いする気満々ではないんですけど、あの、ちょっと泣き、泣きが入るかもしれないです。っていう感じでございます。\n[00:02:15] 担当者: はい。\n[00:02:16] 担当者: そんな感じかな。ちょっと僕から以上でございますね。はい。\n[00:02:19] 辻: はい。\n[00:02:20] 辻: 辻さんのから何かありますかね？\n[00:02:21] 担当者: うん。\n[00:02:21] 辻: ですね。ちょっと昨日からあの、本番環境の方での確認はちょっとスタート、ちょっとしてみてたんですけど、あの。\n[00:02:29] 担当者: そうそうそうそう。\n[00:02:30] 辻: そうですね。あの、トリマスのコピーのところから、ま、ちょっと簡単なところからと思って、えっと、やってて、えっと、とりあえずは。\n[00:02:38] 担当者: これっすね。はい。\n[00:02:39] 辻: はい。あの、今日あのエラーをポンポンと発生させて、ま、メールが届いてるかと思うんですけど。ここって、えっと、件名のところデブがついてるのはもうOKっていうのがなんかどっかでやり取りが。\n[00:02:51] 担当者: もういいです、いいです。\n[00:02:51] 辻: 大丈夫ですか？\n[00:02:52] 担当者: もう、もういいです。あの、あの、いいです、いいです。あの、取っ払おうかと思ったんですけど、もうちょっと、あの、今更取っ払うと大惨事なんで、あの。\n[00:02:59] 辻: ああ、そうですね。\n[00:03:00] 担当者: はい。\n[00:03:01] 辻: いろんなところにありそうですね。\n[00:03:03] 担当者: そうそうそうそう。はい。最悪、あの、全部一通りテスト終わったら、あの、装置感っていうですかね、貴重な手を使おうかなっていうのもあります。あの、ちょ、ちょっと今更家ねえなっていう感じでございます。\n[00:03:14] 辻: はい、分かりました。じゃあ、のところをOKとして、まあ、もうまもなく、えっと、とりあえずは終わりそうなので、えっと、続けて、まあ、えっと、新しい、ま、何にするかは決めてないですけど、ま、ちょっととりあえずちょっと簡単なところから行こうかなと。\n[00:03:28] 担当者: そうですね。はい。\n[00:03:29] 辻: わかりました。\n[00:03:30] 担当者: あ、で、そうそう。これ聞こうと思ったんですけど、あの、簡単にあのトリマスの値がちゃんと変わってるよねっていうのも見といてくださいっていう話をちょっとテスト設計に書いてたんですけど。\n[00:03:39] 担当者: あの、簡単でいいんでちょっと見といていただけると嬉しいかなと思います。あの、名前とか、名前、住所、え、あとあれかな、代表者名とかがちゃんと変わってればOKなんで、はい。\n[00:03:49] 担当者: ちょっと見といていただけると嬉しいかなと思います。はい。\n[00:03:52] 辻: はい。承知しました。\n[00:03:53] 担当者: ま、もうほんと、そのレベルでいいです。あの、これガッツリやる必要全くないです。あの。\n[00:03:58] 担当者: 大丈夫です。その脳理で全然大丈夫です。\n[00:04:00] 担当者: そうそう、言おうと思って忘れちゃいました。ちゃんとメモるって話ですよね。ちょっと話さなきゃいけないことね。うん。\n[00:04:05] 担当者: そう。ちょっとね、ちょっと最近サボってます。申し訳ないです。はい。\n[00:04:11] 担当者: はい。\n[00:04:12] 辻: うん、というところで。\n[00:04:12] 担当者: じゃあ、とりあえずは。\n[00:04:14] 担当者: あれっすからね。粛々とやっていただく形で。俺も粛々とこう、あの、テスト設計粛々とつくるしかないんで。\n[00:04:23] 担当者: 感じでやってます。\n[00:04:24] 辻: うん、今んとこ、運用別途作業っていうのは発生してないんで、はい。\n[00:04:28] 担当者: そうですね。はい。\n[00:04:30] 辻: はい。\n[00:04:31] 担当者: そうですね。\n[00:04:33] 担当者: で、ちょ、ちょっと、ま、ま、並行してその運用設計どうするか、って話もちょっと考えなきゃいけないんですけど。\n[00:04:40] 担当者: うーん、ちょ、ちょっとね、やっぱ、なんか、なんだろうな、ま、ちょ、ちょっと、なんつうんだろうな、JMSCSに慣れすぎたっていうのちょっと正直あるんですけど。\n[00:04:48] 担当者: ちょっとJMSCSとジョブセンターの、そのなんつうんだろうな、仕様がこう、なんだろう、いけてない、いけてないじゃない、なんつうんだろうな、こう、痒いところに、痒いとこってか、あの、JMSCSの融通が効いてたところを。\n[00:05:06] 辻: うーん。\n[00:05:07] 担当者: あの、ジョブセンター全く切り捨てた感が俺ん中で印象あるんですよ。\n[00:05:13] 辻: ああ。なるほど。\n[00:05:14] 担当者: なん、そうですね。\n[00:05:15] 担当者: ちょ、そこら辺がちょっと、うーん、いや、いや、なんだろうな、ちょっとやりづらいっていうのはちょっとあるかなと思うんすよね。\n[00:05:22] 担当者: で、あと、まあ、まあ、大体繰り返して言ってるんですけど、ま、ちょっと辻さんに言ったかどうかわかんないですけど、ジョブセン。\n[00:05:30] 担当者: 対 これってか。\n[00:05:32] 担当者: あの、1月以降ですね。あの。\n[00:05:35] 辻: ああ。\n[00:05:36] 担当者: ま、僕ら、僕らっていうか、あの、いじってる人たちは、ま、ま、しょうがねえなと思ってやってはいいるんですけど。\n[00:05:42] 担当者: うーん、ちょっと、なってこう、ちょっと悩ましいなと思ってます。あの。\n[00:05:51] 担当者: 悩ましいなと思ってます。悩ましいしか言えねえっす、ってことですね。\n[00:05:55] 担当者: あとあれだな、辻さんちょっとあれだ、相談したかったことが、相談っていうわけじゃないんですけど。\n[00:06:02] 担当者: あの、なんだろうな。\n[00:06:05] 担当者: まあいいか。心にゆとりなんて、ちょっと、やっぱ、ちょっとシクってるんすよ、やっぱ俺。\n[00:06:10] 担当者: ま、悩ましいよな、ま、いいんだろうけどな、既存の。やっぱ、こう、なんだろうな、こう、こういう風にやっぱ、なんだろう、ジョブセンター継承しちゃって。\n[00:06:20] 担当者: この貫通名とかにしてると、この処理が何してるかよくわかんねえ。\n[00:06:24] 辻: ああ。\n[00:06:25] 担当者: ちょっと、なんで、ちょっと、そこらへんいやらしいなっていうのはちょっとあるんですけど、まあいいか、もうやめなしだろうな。\n[00:06:32] 担当者: どちらかというこっちの方が分かりやすいんですよ、何があって。で、こっちにしちゃうと、うん、あ、これも分かりやすいんだけど、これなんだ。\n[00:06:39] 辻: うん。\n[00:06:40] 担当者: 調べなきゃいけないっていうちょっと、めんどくささがなるけど、まあいいか、もういいか。\n[00:06:44] 辻: パッと見わかんないっすね。\n[00:06:46] 担当者: わかんないっすね。\n[00:06:47] 担当者: ちょ、シクったな、もう、もうきつくね。もうやってみて分かるっていう。\n[00:06:53] 担当者: ま、ここもちょっとあれだな、超心にゆとりがあったらちょっと直すかあって話をしてんですけど、今は超、超心にゆとりが全くないのと。\n[00:07:02] 辻: ですね。\n[00:07:11] 担当者: はい。\n[00:07:12] 担当者: 一応あとこれか。ま、ちょっと共有しとくと、こういう形で、あの、えっと、その何の処理でエラーが出たかって、たまに書いてる処理があったりするんですけど。\n[00:07:20] 担当者: これちょっとご認識の通り、同じ名前にするとこれ登録できないんで、区別するようにやった感じですね。これ感じ。\n[00:07:27] 辻: ああ、はいはいはいはい。\n[00:07:28] 担当者: そうなんすよ。\n[00:07:30] 担当者: なんて、ちょっとそういうのが、ちょっと量視点であるのと、ま、それもちょっと、て、ま、ま、なんだろうな。\n[00:07:37] 担当者: なんかあれですよね。ヘルパーで、ヘルパーっていうか、Excelのヘルパーで、なんか管理してるところってやっぱボックス単位で1位になってる方が分かりやすいんですよね、これね。何の処理のあれだろうっていうのがあったりするんで。\n[00:07:49] 担当者: ま、それもちょ、悩ましいなと思いながら。\n[00:07:52] 担当者: ではいるんですけど。ま、多分この異常メーとか、メール送信っていうのが多分腐るほどあるんで、多分辻さんが苦労してるとは思うんですけど。\n[00:07:59] 辻: はいはい。\n[00:08:00] 担当者: ま、ちょ、しょうがねえな。あとこれも、あ、そっか、言っとくと、これ、名前の長さもあったりするんですよ。\n[00:08:05] 辻: あ、そうなんですね。\n[00:08:06] 担当者: で、かつ、そうなんすよ。で、かつなんかね、あの、複合技ってか、あの、個々の名前の長長さ以外に、なんか処理として登録する時の名前の長さがね、上限があるらしくって。\n[00:08:18] 辻: ああ。\n[00:08:19] 担当者: ちょっとよくわかんないんですけどね。だから下手に長いのにすると、長くてこう、なんだか、深い処理。や、どんどん掘ってく処理とかにしとくと、あの、長すぎるって怒られるんですよ。\n[00:08:31] 辻: なるほど。\n[00:08:33] 担当者: そうなんすよ。そういう仕様も入ってるっていう、こう、ちょ、ちょっといやらしいんすよね。だから、内部的に多分持ってんだと思うんですけど、その。\n[00:08:43] 担当者: その多分上から多分足してくんでしょうね、このトントンピピピって。足した時に多分桁数超えるんで、あの、キャパオーバーです、みたいな感じなんだと思うんですけど。\n[00:08:53] 担当者: ま、そういうのもちょっと前ちょっと課題として上がってて多分、この、なんだっけ、バックログ上にも書いた記憶はあるんですけどね。\n[00:09:02] 担当者: ま、そういう状況でございます。ま、ちょっと、よ、余談でしたという感じですね。はい。\n[00:09:07] 担当者: 終わりました。じゃ、ちょっと申し訳ないですけど辻さん、とりあえずは粛々とテストをよろしくお願いいたします。で、俺も粛々とあの、テスト設計頑張りますっていう感じなので。\n[00:09:17] 担当者: はい。\n[00:09:18] 担当者: はい。\n[00:09:19] 担当者: じゃあ、ちょっと早いですけど、以上で終わろうかと思いますので、はい。じゃあ、すいません、引き続きよろしくお願いいたします。じゃ、お疲れ様でした。\n[00:09:26] 辻: ありがとうございました。\n[00:09:27] 担当者: ありがとうございます。失礼します。\n[00:09:28] 辻: 失礼します。",
  "meeting_notes": "# 会議議事録\n\n## エグゼクティブサマリー\n-   **日時**: 2025/10/16 11:05\n-   **参加者**: 担当者、辻\n-   **主要議題**: 新AWSサーバーのHTTPS化、サポートへの質問対応、ドクターサムラ関連テスト設計、本番環境でのテスト状況、運用設計とジョブセンターの課題\n-   **重要決定事項**:\n    1.  新AWSサーバーのHTTPS変更完了後、関係者へ周知する。\n    2.  本番環境のエラーメール件名「DEV」は、現状維持で変更しない。\n    3.  辻氏はトリマスの主要な値（名前、住所、代表者名など）の変更を簡単に確認する。\n\n## 主要な議題・トピック\n1.  **新AWSサーバーのHTTPS化と関係者周知**\n    -   **内容**: 新AWSサーバー（新AWSサーバー）において、HTTPからHTTPSへの変更が予定されている。\n    -   **決定事項**: 変更が完了次第、関係者へ周知する。\n    -   **重要なポイント**: 環境変更に関する進捗が共有され、完了後の情報共有が確認された。\n\n2.  **サポートへの質問と対応状況**\n    -   **内容**:\n        -   「例の件」について、サポートへ質問を投げ、バックログに記録済み。\n        -   パスが長すぎる、またはエラーが出る件に関する追加質問を送信し忘れていたが、昨日急遽送信した。\n        -   質問内容は「3環境での運用」「ID重複時の良い方法」「標準的な運用方法」について。\n    -   **決定事項**: なし（状況報告）。\n    -   **重要なポイント**: 担当者がサポートとの連携を進めていること。パス長問題の追加質問が完了した。\n\n3.  **ドクターサムラ関係のテスト設計**\n    -   **内容**: テスト設計が遅れており、現在再着手している。ドクターサムラ関連のシステムは元々の作りが非常に複雑であるため、フロー作成に苦慮している。作成内容に不安があるため、辻氏に確認を依頼する可能性がある。\n    -   **決定事項**: 担当者がドクターサムラ関係のテスト設計を引き続き進める。必要に応じて辻氏が確認に協力する。\n    -   **重要なポイント**: システムの複雑性がテスト設計のボトルネックとなっている。\n\n4.  **本番環境での確認とエラーメール件名「DEV」の取り扱い**\n    -   **内容**: 辻氏が本番環境での確認を開始し、トリマスのコピーから簡単なテストを実施してエラーメールを発生させた。エラーメールの件名に「DEV」が付いている件について、このままで良いか確認。\n    -   **決定事項**: エラーメールの件名に「DEV」が付いていても現状維持で問題ない。今更変更すると他のシステムに「大惨事」を招く可能性があるため。\n    -   **重要なポイント**: 現在のDEV表記は維持し、将来的に全てのテストが完了した後に一括修正の可能性も検討される。\n\n5.  **トリマスの値の簡単な確認依頼**\n    -   **内容**: 辻氏に対し、テスト設計に記載されているトリマスの値（名前、住所、代表者名など）が正しく変更されているかを簡単なレベルで確認するよう依頼。\n    -   **決定事項**: 辻氏がトリマスの主要な値の変更について、簡単な目視確認を実施する。\n    -   **重要なポイント**: 詳細な確認は不要であり、主要な項目が正しく反映されているかの確認で十分である。\n\n6.  **運用設計とジョブセンターに関する課題・懸念**\n    -   **内容**:\n        -   運用設計を並行して検討する必要がある。\n        -   JMSCSに慣れているため、ジョブセンターの仕様が使いづらい（JMSCSの柔軟性がジョブセンターでは失われていると感じる）。\n        -   ジョブセンターのジョブ名や貫通名が処理内容を直感的に判断しにくく、調査が必要となる。\n        -   処理登録時に名前の長さ制限があり、特に階層が深い処理では長すぎるとエラーになる（内部的にパスのように長さを合計している可能性）。\n    -   **決定事項**: なし（課題と懸念の共有）。\n    -   **重要なポイント**: ジョブセンターの仕様が既存の運用や開発フローに課題をもたらしており、運用設計において考慮が必要な点が多い。特に名前の長さ制限は具体的な障害となる。\n\n## ユーザーの主要なアクション項目・コミットメント\n-   **担当者**:\n    -   新AWSサーバーのHTTPからHTTPSへの変更完了後、関係者に周知を行う。\n    -   ドクターサムラ関係のテスト設計を継続して作成する（必要に応じて辻氏に確認依頼）。\n    -   運用設計について検討を進める。\n-   **辻**:\n    -   本番環境でのテスト（トリマスのコピー、エラー発生、メール受信確認）を継続する。\n    -   トリマスの主要な値（名前、住所、代表者名）の変更を簡単に確認する。\n\n## 決定事項サマリー\n-   新AWSサーバーのHTTPS化完了後、関係者へ周知する。\n-   本番環境のエラーメール件名「DEV」は、現状のままで変更しない。\n-   辻氏はトリマスの主要な値の簡単な確認を実施する。\n\n## 次回までの課題・懸念事項\n-   運用設計の具体化と、JMSCSとジョブセンター間の仕様の違いへの対応策検討。\n-   ジョブセンターにおけるジョブ名/処理名の分かりにくさ、および名前の長さ制限への長期的な対応。\n-   ドクターサムラ関係の複雑なテスト設計の進捗と品質確保。\n\n## 備考・その他の重要な情報\n担当者はテスト設計の作成に、辻氏はテストの実施に、それぞれ粛々と取り組むことで合意した。\nジョブセンターの仕様に関する課題は、引き続き運用に影響を与える懸念事項として認識された。",
  "meeting_date": "2025-10-16T11:05",
  "conditions": "",
  "timestamp": "2025-10-16T11:06:37.346132",
  "file_size": 3430944
}