{
  "filename": "20251014103118_20251014_154501.mp3",
  "transcript": "[00:00:00] 話者1: えっと、僕からなんですけど、ちょっとあの、ま、前、ずっと前から言ってる、あ、画面共有してねえや。あの なんだっけ、ヘルパーとかの、なんだっけ、えっと、ファイルで連携するやつあるじゃないですか。ジョブセンターに対して。\n[00:00:17] 話者1: アップロード。\n[00:00:18] 辻: はい。\n[00:00:20] 話者1: で、それちょっとあの、ヘルパー、あ、なんだっけな、えっと、サポートにちょっと聞いてみ、今週中に聞いてきますんで。なんかいい方法ねえか。\n[00:00:27] 辻: ああ、はい。\n[00:00:28] 話者1: あの、あの番号が、あれじゃないですか。あの、ちょっと環境によって発番されちゃってちょっとIDが1じゃないとできないって話か、可能性があるんで。ちょっと、なんかいい方法ねえかっていうのちょっとこれ、あの、課題作りましたんで、ちょっと、えっと、聞いてみますんで、はい。\n[00:00:46] 話者1: よろしくお願いいたします。という感じですね。で、あと、辻さん、ありがとうございました。あの、えっと、チェックの処理削除してくださる件、ありがとうございます。ってとこですね。\n[00:00:56] 話者1: で、あとは、えっと、そんなとこかな、僕から言って。で、あれっすね、えっと、特に、追加で辻さんにちょっと急ぎでお願いするってことないんですけど。\n[00:01:08] 辻: はい。\n[00:01:10] 話者1: あの、テスト、あと、本番環境、あの、テストあったやつのあの、稼働、の登録ですね。なんとかちょっとしていただけると嬉しいかなと思います、はい。そんな感じです。ございます。\n[00:01:22] 辻: はい。\n[00:01:22] 話者1: はい。\n[00:01:24] 話者1: 僕の方から以上でございます。辻さんの方から、何か、ありますかね。\n[00:01:27] 辻: えっと、ちょっと2点確認というか、あ、あれなんですけど。\n[00:01:30] 話者1: あ、どうぞ。\n[00:01:31] 辻: えっと、はい。えっと、今本番の方で、えっと、稼働確認を、進めようとしてるんですけど、ちょっと、あの。\n[00:01:38] 話者1: はい。\n[00:01:39] 辻: えっと、総合テスト、あの、林とか宇野がやってるやつのジョブの登録のところでちょっと、なかなか、あの、うまくいかないことがあって、ちょっと進捗がこれから本格的にやっとスタートできる、いう感じなんですけども。あの、えっと、本番で確認するにあたって、えっと、DBをなんか同期を取らないといけないというお話だったじゃないですか。あの、ステージング環境と。\n[00:02:05] 話者1: DBの同期？\n[00:02:06] 辻: えっと、ステージングと、えっと、本番。\n[00:02:09] 話者1: ああ、はいはいはいはいはい。で、えっと、画面、画面の話っすね。\n[00:02:13] 辻: はい。\n[00:02:13] 辻: で、えっと、新テスト、えっと、ごめんなさい。えっと、本番環境で動かす画面っていうのは、あの、グレーですよね。確認なんですけど。グレー画面？\n[00:02:25] 話者1: えっと、画面の話、あ、えっと、はい。グレーで合ってます。あの。\n[00:02:33] 話者1: こっちじゃないや。えっと。新、えっとね、新、新AWLって言ってるやつですね。こいつです、これ。\n[00:02:46] 話者1: あの、多分今日、今日明日までだと思います、でもこれ変わる予定です。\n[00:02:50] 辻: あ、そうなんすか。\n[00:02:51] 話者1: あの、HTPSが、あの、ついてない方こいつ。\n[00:02:54] 辻: あ。\n[00:02:55] 話者1: なんでHTPSつくやつに、えっと、これと、あとステージングですね。紫の。\n[00:03:01] 辻: 紫ですね。\n[00:03:02] 話者1: これですね。これをやっていただく。で、確か辻さんのアカウント、登録しといたと思うんすけど、両方とも。\n[00:03:10] 辻: 確か、うん、あの、確認して、はい、入れて、画面の表示まで行けたはずですね。\n[00:03:19] 話者1: そうすね。えっと、0、あれっすね、ITじゃないST0。\n[00:03:25] 辻: えっと、覚えてない。\n[00:03:27] 話者1: ま、いっか。\n[00:03:29] 辻: あ。\n[00:03:30] 話者1: ま、いっか。ま、ちょっと、入れなかったら言ってください。ちょっと、あの、登録したきままでいます。\n[00:03:36] 辻: で、えっと、あの、データの同期を取らないといけないっていうのは、その画面上の入力の項目についての、お話でいいんです。\n[00:03:45] 話者1: あ、そうそうそうそう。ネイルです。あの、他でもちょっとここテストしてるんで、あの、ちょっと同じようなデータ打っとかないと、あの、あれなんか違うぞって話になっちゃうんで。登録してもらう形で考えてます、はい。\n[00:04:00] 辻: テストの本、えっと、メインで行おうとしているあの、本番でのバッチ処理、あのジョブの稼働については、えっと、本番だけで動かせばいいいうことですね。\n[00:04:12] 話者1: あ、そうっすそうっす。本番だけでどんどん動かしちゃって。あの、なんだっけね、えっと、はい、あの、登録してその動、ごめんなさいね。動かしっぱなしにしといてなんか問題が出ないかっていうのを、確認する形ですね、はい。\n[00:04:27] 辻: 分かりました。じゃあ、えっと、ちょっと確認は以上なんですけども。えっと、もう1点、あの。先週対応したあの、そのジョブのチェックを外す。\n[00:04:39] 話者1: はい。\n[00:04:40] 辻: 作業の時に、あの、ジョブネットワークにぶら下がっているユーザブのチェックのところを削除しようとしたんですけども。あの、Excel、ヘルパーのExcel上、そこの部分だけ削除っていうのができなくって。\n[00:04:59] 辻: えっと、Excel、ヘルパーの中で。\n[00:05:03] 話者1: えっと、あ、ごめんなさい。えっと。ちょっと、あ、どういうことだ？\n[00:05:09] 辻: えっと、Excel。\n[00:05:10] 話者1: え、え、えっと。\n[00:05:12] 辻: ヘルパーのExcelを開いて。\n[00:05:16] 話者1: 今立ち上げますよね。\n[00:05:17] 辻: はい。\n[00:05:22] 話者1: これ、これあれっすね、あの、辻さんからもらったやつです。こいつで、なんだっけ、チェック。\n[00:05:38] 話者1: あ、ちょっと待ってね。チェック。\n[00:05:52] 話者1: なんかあれっすよね。ちょ、ちょっと全然話変わるんすけど。\n[00:05:55] 辻: はい。\n[00:05:56] 話者1: あの。確かこのチェック処理ってあの処理名があの、なんかJMSSの内容をパクったんすけど。あの。なんすかね。ちょっと、なんかもうちょい分かりやすい名前にしときゃよかったなっていうのはちょっと反省しております。分かりづれえなと思って。\n[00:06:21] 話者1: これっすよね、データチェック。これとか名前っすね。\n[00:06:24] 辻: そうですね。\n[00:06:25] 話者1: これ、何、何々チェックとか。\n[00:06:27] 辻: で、いらない。\n[00:06:28] 話者1: ユーザーブとかですよね。\n[00:06:29] 辻: はい。\n[00:06:30] 辻: とを、削除しようと思ったんですけど、そこをどうやって削除したらいいのか分からなくって。で、\n[00:06:39] 辻: あ、そういうこと。上のとこの部品コントロールからジョブネットワークごとは削除できるんです。あの、上からF。\n[00:06:46] 話者1: できますね。うん、はい。\n[00:06:48] 辻: でも、ユーザー。\n[00:06:49] 話者1: こうすよね。\n[00:06:49] 辻: ああ、これか。その、大きいボタンのところですね。\n[00:06:53] 話者1: はい。\n[00:06:54] 辻: で、その1番下のF11でジョブネットワークの削除はできるんですけど、それにぶら下がっている個別にユーザブだけここからここまで削除っていうのができなくって。で、えっと、最終的にやったのは、あの、本番のジョブセンターサーバーの実際のものを、えっと、加工して削除して、それをエクスポートして、これ、ジョブネットワークをExcel上からは全部削除してインポートし直して形にな、やったんです。\n[00:07:29] 話者1: なるほどね。\n[00:07:31] 辻: そうすると、まあ、IDが1番マックスから採番され直した状態なんで、1番下に、え、出てきてしまったんですけど。\n[00:07:43] 辻: こ、れって、えっと、本当の正しいというか、ユーザブだけ削除っていうのをやるのはどういう方法でやるのが本当は正しかったのかなと、ちょっと、あ、あ、自後。\n[00:07:56] 話者1: あれ、ごめんなさい。普通に消せませんでした？多分。\n[00:08:00] 辻: あ、いけるんすか。なんか。\n[00:08:02] 話者1: これ、これ、これあるじゃないですか。仮にこのインブ消そうと思ったら、こう、こう多分こう、こうっすよね。\n[00:08:10] 辻: あああ。\n[00:08:14] 辻: それで右。\n[00:08:15] 話者1: で、これバン。\n[00:08:17] 話者1: いや、これ右クリックできねえっすよ。\n[00:08:21] 辻: あ、こうやって消してしまおう。ね。\n[00:08:24] 話者1: あ、そう、そう、そう。駆逐しようです。\n[00:08:26] 辻: ああ、そういうことっすか。ああ、なるほど。\n[00:08:29] 話者1: ここ、これで、で、これ、ここからぺって、あれ、間違えた。ちょっと待ってね。こっから、ここまでじゃないですか。で、こいつ、ぺってやるじゃないですか。ごとごと。で、飛んだ時に。\n[00:08:42] 辻: あ、これ。\n[00:08:44] 話者1: これ分岐のIDがあるんで、多分分岐4にしとかないと辻さん上がんないはずなんすよ。これでチェックってやると、その合ってるか合ってないかを見てくれるはずなんすよね。で、ダメなら怒られます。\n[00:08:56] 辻: ああ。\n[00:08:58] 話者1: あ、そうか。これとオッケーだったんで、こういう風にしないとダメです。仮にこれ5のままだと、仮にね、これぺってあるじゃないですか。多分、そん、そんな場合もねえぞって、もしか飛んでるよって怒られると思うんすよね。\n[00:09:12] 話者1: 言わないすね。\n[00:09:14] 辻: あ、いける。\n[00:09:15] 話者1: いけるんだな。これいけるの、本当いけるのか。ま、こんな感じで、あの、いいすね。で、ここら辺の番号とかを、振り直しちゃうと、ここら辺の多分先行のやつとか変えなきゃいけないんすよ。で、こいつは、えっと、並列のやつなんで、あの、こういうチェックでいいんすけど。\n[00:09:32] 辻: はい。\n[00:09:32] 話者1: その並列じゃないやつは、もうちょっと考えないと、あの、ダメですね。なんでやり方がちょっと、な、なんすかね、ちょっと仕様を理解していかないと多分できな、できないっていうか。俺もちょっと細かく、マニュアル見てないんでなんとも言えないんですけど。これ、こういう状態じゃないですか。で、今更新したんで、飛ぶと思うんすよね。飛ぶっていうかな、なくなってると思うんすよ。\n[00:09:56] 辻: ああ、上に上がった感じになるんですね。\n[00:09:58] 話者1: で、これ5、5なんで、これ1個のやつじゃないですか。\n[00:10:01] 辻: はい。\n[00:10:01] 話者1: で。これもちょっとめんどくせえんだよな、この移動がな。んで、これをちゃんと、あれ、4になってもあれだな。となるとこれ分岐んとこに5ってのがどっかに、あ、ここに5ありましたね。分岐5なんで4にして。\n[00:10:17] 辻: はいはい。\n[00:10:22] 話者1: やるとまたいかなくなっちゃうわ。\n[00:10:25] 辻: あ。\n[00:10:28] 話者1: よいしょ。ちょっとこれもう、多分あれっすね、全、全検索ブックで検索してシート名で飛ぶっていうので募集してます。これが1番行きやすいって。\n[00:10:41] 辻: ああ。\n[00:10:42] 話者1: こんな感じでいくと4つになるんで、多分こういう風にしないと多分ダメなんだと思うんすよね。\n[00:10:47] 辻: あ、そういうことか。あの、行削除しようとしてて、削除ができないなと思って、困ってたんすけど。そう、あ、値を、そのま、ま、上に上げる感じでいけば。\n[00:10:58] 話者1: あ、そうそうそうそう。飛ばしちゃえばオッケー。そうすれば番号とかも、あの、ちゃんとオッケーなんで、大丈夫です。で、ちょっと気をつけなきゃいけないのが、さっきも言った通り。ここら辺の、こいつって分岐のポイントなんで、こいつがポイントになるんですよ。1、2、3、7、5。で、こいつとかなくしちゃうと、なくすというか、ちょっと変えたりすると、ま、変えたりっていうかなんだろな。追加とかする時は、新たになんかこの番号が振られてきちゃうんで、この分岐の番号が。それに合う形でその上位の設定。上位っていうか、あの、前のやつ。項目あるじゃないですか、ここの先行部品。\n[00:11:32] 辻: はい。\n[00:11:33] 話者1: ここ多分同期取らなきゃいけないんで、ここがちょっとややこしいていうか、めんどくさいんすよ。合わせとかなきゃいけないんで。\n[00:11:40] 辻: あ、なるほど。はい。分かりました。\n[00:11:43] 話者1: 137じゃないですか。137ってのはこの、PA、RBって、さっきのあの分岐のところになってるはずなんで。そうしないといけないんで、ちょっとややこしい感じです。ま、ちょっとそこら辺、ヘルプですね、見てもらうと分かるんすけど。ちょっと俺もそこまでごめんなさいね、あの、読み込んではないんすよ。マニュアル。こいつ。\n[00:12:10] 辻: あ、はい。\n[00:12:16] 話者1: ここら辺すね。多分このディファインヘルパーってやつなんだろうなと思うんすけど。ここら辺でやる感じってか。あ、あと、あそこ、もう1つ言っとくと。あの、ま、ここら辺で書いてあるところが多分ポイントなるのと、あとこいつっすね。このテキスト定義機能ってやつ。\n[00:12:43] 辻: はい。\n[00:12:46] 話者1: こいつが、あの、実際のフォーマットみたいな感じなんすよね。ま、これファイル形式なんでちょっと微妙かな。ちょっと、基礎とかも書いてあんな。うん、ちょっと、ごめんなさい。何が言いたかったかと、こいつ、こいつが、大元のはずなんで。あの、仕様の。\n[00:13:10] 辻: ああ。\n[00:13:10] 話者1: で、こいつである程度理解して。\n[00:13:13] 辻: ああ。\n[00:13:14] 話者1: で、こ、こっちの後の棒はこれヘルパーの、あのExcelの方なんで、あのさっき言ったこのテキストの仕様に従ってこのヘルパーの仕様作ってるはずなんで。あの、テキストの方が分かれば、多分ヘルパーの方も分かんじゃねえかなっていうのでちょっと話してたんですけど。いや、でもめんどくさいと思いますね。\n[00:13:35] 辻: はい。\n[00:13:37] 話者1: 超めんどくさいと思います、この、あの、ツール。\n[00:13:40] 辻: はい。\n[00:13:41] 話者1: ま、ちょっと、なんとも言えないっすよね、ってとこですね。\n[00:13:45] 辻: はい。\n[00:13:46] 話者1: すいません。ちょっと、あの、繰り返しになるんすけど、僕もそこまでこう、えっと、読み込んでないの。と、あと、ある程度こう。あ、あとあれだ、ごめんなさい。もう1つポイントが、ここでやった時ポイントが、ここにコメントが書いてあったりするんすよ。\n[00:14:02] 辻: あ、書いてありますね。はい。\n[00:14:04] 話者1: これとかたまに参考にしてます。\n[00:14:06] 辻: ああ。\n[00:14:08] 話者1: たまにこう、なんだろうな。これ見づらいんだけど。このロックがかったるいんすよね、マジで。これなんか先行部品指定しますよ。\n[00:14:19] 辻: ああ。\n[00:14:20] 話者1: だからジョブネットワークは、あ、そうか、ジョブネットワークは呼び出し元とか先行部品とかねえぞって。ま、そりゃそうだよね。うん、ま、そんな感じで見てたりしますね。\n[00:14:32] 辻: 分かりました。はい、ありがとうございます。\n[00:14:35] 話者1: ちょっと参考にしていただけるといいかなと。\n[00:14:38] 辻: はい。\n[00:14:39] 辻: えっと、以上です。はい。\n[00:14:41] 話者1: はい。分かりました。ありがとうございます。じゃ、ちょっと引き続きちょっとテストの方ちょっとお願いしますって話と。ちょっと僕の方もちょっと、設計書の方が、今絶賛作ってる。で、大体、大体あと、あとは、確か、あの、アフター絡み、アフター、EC絡みだけになっった気がするんだよな。あと、SFTP絡むところ以外。で、ちょっと今週中に片付けたいなと思ってはいるんすけど。じゃねえな。これか。ですね。ここら辺が、あと、沖館もちょっとやっつけ仕事、あの、金曜日にやったん、やっつけたのと。\n[00:15:30] 辻: はい。\n[00:15:31] 話者1: あとこれ、ちょっとFTP、SFTP絡むんでちょっと保留にしてるんすけど。ま、一緒にこっちのEC合わせるように、やってはいます、はい。そんな感じですね。はい。\n[00:15:42] 辻: はい。\n[00:15:43] 話者1: じゃ、ちょっと、申し訳ないんですけど、引き続きちょっとよろしくお願いいたします。ちょっと、また何かあったらちょっと、追加で言うと思うんすけど、現時点ではちょっと、ないんすけど。ちょっと色々、その、リリースに向けてやんなきゃいけないことがちょっとまだストックがあるので。多分11月かな、ちょっとやんなきゃいけない感じでございます、はい。\n[00:16:02] 辻: はい。\n[00:16:02] 話者1: はい。\n[00:16:04] 話者1: じゃあ、すいません。以上で終わろうかと思います。じゃあ、引き続きよろしくお願いいたします。じゃあ。\n[00:16:09] 辻: いたします。\n[00:16:09] 話者1: ありがとうございました。お疲れ様です。切りします。\n[00:16:12] 辻: します。",
  "meeting_notes": "# 会議議事録\n\n## 会議概要\n- 日時: 不明\n- 参加者: 話者1、辻\n- 議題: ジョブセンター連携ファイルの課題、本番環境稼働確認の進捗とDB同期、ヘルパーExcelでのジョブ/ユーザブ削除方法\n\n## 主要な議題・トピック\n1.  **ジョブセンター連携ファイルの課題と改善検討**\n    - 内容: ヘルパーなどで使用するジョブセンターへのファイル連携（アップロード）において、環境によってID発番が異なりIDが1でないと連携できない可能性がある。これに対する良い方法をサポートに確認する必要がある。\n    - 決定事項: なし（サポートへの確認アクション）\n\n2.  **本番環境稼働確認の進捗とDB同期、画面利用**\n    - 内容:\n        - 辻氏より、本番環境での稼働確認を進行中だが、総合テストでのジョブ登録がうまくいかず進捗が遅れている現状を報告。\n        - 本番での確認にあたり、ステージング環境とのDB同期の必要性、および本番環境で利用する画面（グレー画面）について確認。\n        - 話者1より、本番環境で利用する画面はグレー画面（新AWL、HTPSなし）とステージング（紫）が正しいことを確認。辻氏のアカウントは両環境に登録済み。\n        - DB同期は、画面入力の項目において、他テストとの整合性を保つために同じデータを入力する目的で行う。\n        - バッチ処理（ジョブの稼働）については、本番環境のみで実行し、問題が発生しないかを確認する形で良いと確認。\n    - 決定事項:\n        - 本番環境での稼働確認には、グレー画面（新AWL、HTPSなし）およびステージング（紫）を使用する。\n        - 画面入力については、テストデータの一貫性を保つため、ステージング環境と同期したデータ入力を行う。\n        - バッチ処理（ジョブ稼働）は本番環境のみで実行し、問題発生有無を確認する。\n\n3.  **ヘルパーExcelでのジョブ・ユーザブ削除方法**\n    - 内容:\n        - 辻氏より、ジョブのチェックを外す作業において、ジョブネットワークにぶら下がっているユーザブのチェック処理をヘルパーExcel上で個別に削除する方法が分からなかったため、ジョブセンターサーバーのものを加工・エクスポートし、Excelからは全て削除してインポートし直した経緯を報告。この方法だとIDが再採番されてしまう。\n        - 正しいユーザブの削除方法について、話者1に確認。\n        - 話者1より、対象行を削除（カット）し、その後の行をシフトアップさせることで対応可能と説明。この際、分岐のIDや先行部品の設定の整合性を保つ必要がある点、関連ヘルプドキュメント（Define Helper, テキスト定義機能）やExcel内のコメントも参考にできるとアドバイス。\n    - 決定事項:\n        - ヘルパーExcelでのユーザブ（ジョブ）の削除は、対象行を削除（カット）し、その後の行をシフトアップすることで対応する。この際、分岐IDや先行部品の設定の整合性を保つ必要がある。\n        - 詳しい操作方法はヘルプドキュメント（Define Helper, テキスト定義機能）およびExcel内のコメントを参考に確認する。\n\n## 決定事項\n- 本番環境での稼働確認には、グレー画面（新AWL、HTPSなし）およびステージング（紫）を使用する。\n- 画面入力については、テストデータの一貫性を保つため、ステージング環境と同期したデータ入力を行う。\n- バッチ処理（ジョブ稼働）は本番環境のみで実行し、問題発生有無を確認する。\n- ヘルパーExcelでのユーザブ（ジョブ）の削除は、対象行を削除（カット）し、その後の行をシフトアップすることで対応する。この際、分岐IDや先行部品の設定の整合性を保つ必要がある。\n\n## アクションアイテム\n- **話者1**: ジョブセンター連携ファイルの改善策について、今週中にサポートへ確認する。 - 今週中\n- **辻**: テスト・本番環境での稼働登録を進める。 - 期限なし\n- **辻**: ヘルパーExcelでのジョブ（ユーザブ）削除方法について、話者1の説明内容とヘルプドキュメントを参照し、正しい手順を理解する。 - 期限なし\n\n## 次回までの課題\n- 話者1: 設計書作成（アフター・EC絡み、SFTP絡み以外）を今週中に完了させる。\n- リリースに向けた未対応タスクの洗い出しと対応（11月頃を想定）\n\n## 備考\n- 話者1より、辻氏による「チェック処理削除」への協力に感謝が述べられた。\n- 話者1より、チェック処理の名称が分かりづらいという反省があった。",
  "meeting_date": "",
  "conditions": "",
  "timestamp": "2025-10-14T15:47:17.766854",
  "file_size": 5863104
}