{
  "filename": "20251015103137_20251016_083503.mp3",
  "transcript": "[00:00:00] 説明者: ちょっと資料を用意してないんですけど、あの えっ、薄緑環境じゃなかった、えっと、新AWSサーバーなんですけど、HTTPからHTTPSに変換されるんですよ。なんで、ちょっとそれが終わったら、ちょっと関係者にちょっと周知しようかと思ってますので、ちょっとよろしくお願いし ます、というところですね。はい。それが1点と、で、あとはあの、なんだっけ？\n[00:00:23] 説明者: サポートに質問一応投げとけました。あの、例の件。えっとですね。\n[00:00:29] 説明者: えっと、なんだっけ？一応バックログに、えっと、貼っといたんですけど。\n[00:00:36] 説明者: あとですね、ちょっと言っとかなきゃいけないことがあって、あのパスの件あったじゃないですか。パスというかエラーが出る件。\n[00:00:41] 辻: ああ、はい、長すぎる、と、っていうやつですね。\n[00:00:44] 説明者: あ、そうそうそうそう。で、それ、あの、追加でそのパス長すぎるんだけど、みたいな話をちょっと投げる気満々でいたんだけど、どうも送信ボタンを押し忘れてたらしくて、ちょっと昨日、昨日急遽押しましたっていう感じです。一応こういう形で投げときますた。あの、例の件は。\n[00:01:02] 説明者: 一応3環境やります。で、運用しようと思ってます。IDかぶってんだけどなんかいい方があるって話と、あと標準的な運用方法、なんかあれば教えてくれと。\n[00:01:11] 辻: はい、そうですね。\n[00:01:14] 説明者: あまり、あまり期待せずにいるかなと。うーん、というちょっと質問投げてんですけど。という状況でございます。はい。\n[00:01:21] 辻: はい。\n[00:01:22] 説明者: で、あとはちょっとテスト設計をちょっとサボってた部分があったので、今一生懸命あの、また着手始めました。あのドクターサムライ関係のやつをやってるので、ま、ちょっとそこをでやってますと。作ってません。で、ドクターサムライのやつがですね、結構\n[00:01:39] 説明者: あの、これ見えますかね？元々のこの作りがすごい複雑なんですよ。\n[00:01:44] 辻: ああ、はい。\n[00:01:45] 説明者: これね。で、何々が終わったらこう、で、一応それを加味した形でフローを作ってるんですけど。\n[00:01:52] 説明者: あの、ちょっと俺がやらかしてねえかってのがちょっと非常に不安ではあるんですけど、一応これ作ってますという感じで、もしかしたら辻さんちょっとこれすいません確認してっていわゆる可能性もあるんでよろしく。あの、お願いしますって感じです。\n[00:02:06] 説明者: あの、めんどくさそうなやつちょっと全部辻さんにお願いする気満々ではないんですけど、あの、ちょっと泣きが、泣きが入るかもしれないです、という感じでございます。はい。そんな感じかな。ちょっと僕から以上でございますね。はい。\n[00:02:19] 辻: はい。\n[00:02:20] 辻: 辻さんの方から何かありますか？\n[00:02:21] 説明者: そうだそうだ。\n[00:02:21] 説明者: ええ、そうですね。ちょっと昨日からあの、本番環境のの方での確認をちょっとスタート、ちょっとしてみてたんですけど。あの、\n[00:02:29] 説明者: そうだそうだ。\n[00:02:31] 説明者: そうですね、あのトリマスのコピーのところから、ま、ちょっと簡単なところからと思って、えっと、やってて、えっと、とりあえずは\n[00:02:38] 辻: これですね。はい。\n[00:02:39] 説明者: はい、あの、今日あのエラーをポンポンと発生させて、ま、メール、メールが届いてるかと思うんですけど、ここって、えっと、件名のところデブがついてるのはもうOKっていうのがなんかどっかでやり取りがあったような。\n[00:02:51] 辻: もういいです、いいです。\n[00:02:51] 説明者: 大丈夫です。もう、もういいです。あの、あの、いいです、いいです。あの取っ払おうかと思ったんですけど、もうちょっとあの、今更取っ払うと大惨事なんで、あの、このままいこうかなと。\n[00:03:00] 辻: はい。そうですね。いろんなところにありそうですね。\n[00:03:03] 説明者: そうそうそうそう。最悪、あの全部テストだったら、あのソチカンっていうですね、貴重な手を使おうかなっていう、案もあ、あります。あの、ちょ、ちょっと今さら言えねえなっていう感じでございます。\n[00:03:14] 辻: はい、わかりました。\n[00:03:14] 説明者: はい、いいです。このデブのところOKとして、ま、もうまもなく、えっと、とりあえずは終わりそうなので、えっと、続けて、まあ、えっと、新しい、ま、何にするかは決めてないですけど、ま、ちょっととりあえずちょっと簡単なところからいこうかなと。はい。\n[00:03:28] 辻: そうですね。はい。\n[00:03:29] 説明者: わかりました。\n[00:03:30] 説明者: あ、で、そうそう。これ聞こうと思ったんですけど、あの、簡単にあのトリマスの値がちゃんと変わってるよねってのを見といてくださいって話もちょっとテスト設計に書いてたんですけど。あの、簡単でいいんでちょっと見といていただけると嬉しいかなと思います。あの、名前とか、名前、住所。\n[00:03:45] 説明者: え、あとあれかな、代表者名とかがちゃんと変わってればOKなんで。はい。\n[00:03:49] 説明者: ちょっと見といていただけると嬉しいかなと思います。はい。\n[00:03:52] 辻: はい、承知いたしました。\n[00:03:53] 説明者: もう本当そのレベルでいいです。あの、これガッツリやる必要全くないです。あの。\n[00:03:58] 説明者: 大丈夫です。そののりで全全然大丈夫です。そうそう言おうと思って忘れました。ちゃんとメモれって話ですよね。ちょっと話さなきゃいけないことね。うん。\n[00:04:05] 説明者: そうなんすよ。ちょっとね。ちょっと最近サボってます。申し訳ないです。はい。\n[00:04:11] 説明者: はい。\n[00:04:12] 説明者: じゃあ、とりあえずは\n[00:04:15] 説明者: あれっすからね。粛々とやっていただく形で、ちょ、俺も粛々とこう。あのテスト設計粛々とつくるしかない。感じでやってます。\n[00:04:24] 辻: うん、今んとこ、運用別途作業っていうのは発生してないんで、はい。\n[00:04:28] 説明者: そうですね。はい。\n[00:04:30] 説明者: そうですね。\n[00:04:33] 説明者: で、ちょ、ちょっと、まあ、まあ、並行してその運用設計どうするかという話もちょっと考えなきゃいけないんですけど。\n[00:04:40] 説明者: うーん、ちょ、ちょっとね、やっぱなんか、なんだろうな。ちょ、ちょ、ま、ちょっと、なんつうんだろう、JMSになれすぎたってのをちょっと正直あるんですけど。\n[00:04:48] 説明者: ちょっとJMSとジョブセンターのそのなんつうんだろうな、仕様がこう、なんだろう、いけてない、いけてないじゃないですか。なんつうんだろうな、こう、痒いところに、痒いっていうか、あの、JMSの融通が効いてたところを。\n[00:05:06] 辻: うーん。\n[00:05:07] 説明者: あの、ジョブセンター全く、切り捨ててきた感が俺ん中に印象あるんすよ。\n[00:05:12] 辻: ああ。\n[00:05:14] 辻: うん、そうですね。\n[00:05:15] 説明者: ちょ、そこらへんがちょっと、うーん、いや、いや、なんだろうな、ちょっとやりづらいってのはちょっとあるかなと思うんすよね。で、あと、ま、大体繰り返しって言ってるんですけど、ま、ちょっと辻さんに言ったかどうか分かんないんですけど。ジョブセン、壊れてっかなって。あの、1月以降ですね。あの、ま、僕ら、僕らっていうか、あのいじってる人たちは、まあ、まあ、しょうがねえなと思ってやってはいるんですけど。\n[00:05:42] 説明者: うーん、ちょっとなあ、って、こう、うーん、ちょっと悩ましいなと思ってます。あの。\n[00:05:50] 説明者: 悩ましいなと思ってます。もう悩ましいしか言えねえなと。てことで。あとあれだな、辻さんちょっとあれだ、相談したかったことが、相談ってわけじゃないんですけど。\n[00:06:02] 説明者: あの、なんだろうな。ま、いいか。心にゆとりなんて、ちょっとやっぱ、ちょっとしくってんすよ、やっぱ俺。ま、悩ましいような、ま、いいんだろうけどな、既存のやっぱこう、なんだろうな、こう、こういう風にやっぱ、なんだろう、ジョブセンター継承しちゃって、この貫通名とかにしてると、この処理が何してるかてよくわかんねんだ。\n[00:06:24] 辻: ああ。\n[00:06:25] 説明者: ちょっと、なんで、ちょっとそこら辺いやらしいなってのちょっとあるんですけど、まあいいか、やむなしだろうな。どちらかというとこっちの方が分かりやすいんすよ。何がって。で、こっちにしちゃうと、うん、あ、これも分かりやすいんだけど、これなんだと。\n[00:06:38] 辻: うん。\n[00:06:40] 説明者: 調べなきゃいけないっていう、ちょっとめんどくささがあったけど、まあいいかと。もういいかと。\n[00:06:44] 辻: パッと見わかんないですね。\n[00:06:46] 説明者: わかんないです。\n[00:06:48] 説明者: ちょっとしくったなと、もう。やってみて分かるっていう。\n[00:06:53] 説明者: ま、ここもちょっとあれだな、超心にゆとりがあったらちょっと、あの、直すかって話だったんですけど、今は超、超心にゆとりが全くないのと。\n[00:07:02] 辻: ですね。\n[00:07:11] 説明者: はい。\n[00:07:12] 説明者: 一応あとこれか。ちょっと共有しとくと、こういう形で、あの。\n[00:07:17] 説明者: えっ、その何の処理でエラーが出たかって、たまに書いてる処理があったりするんですけど、これちょっとご認識の通り、同じ名前にするとこれ登録できないんで、区別するようにやった感じですね。これ。\n[00:07:26] 辻: ああ、はいはいはい。\n[00:07:28] 説明者: そうなんすよ。\n[00:07:30] 説明者: なんで、ちょっとそういうのがちょっと良し悪しであるのと、ま、それもちょっとなあって、ま、ま、なんだろうな。\n[00:07:36] 説明者: なんか、あれっすよね。ヘルパーで、ヘルパーっていうかExcelのヘルパーでなんか管理してると、やっぱボックス単位で一致になった方が分かりやすいんですよね、これね。何の処理のあれだろうってのがあったりするんで。ま、それもちょっと悩ましいなと思いながら、いてはいるんですけど、ま、多分この異常メールとかメール送信ってのが多分腐るほどあるんで、多分辻さんが苦労したやつだと思うんですけど。\n[00:07:59] 辻: はいはい。\n[00:08:00] 説明者: ま、ちょっとしょうがない。あとこれも、あ、そっか、言っとくとこれね、名前の長さもあったりするんすよ。\n[00:08:05] 辻: あ、そうなんですね。\n[00:08:06] 説明者: で、かつ、そうなんすよ。で、かつ、なんかね、あの複合技っていうか、あのこの名前の長、長さ以外に、なんか処理として登録する時の名前の長さが上限があるらしくて。\n[00:08:18] 辻: ああ。\n[00:08:19] 説明者: ちょっとよく分かんないですけどね。だから下手に長いのにすると、長くてこう、掘り、なんか深い処理、要はどんどん掘ってく処理とかにしとくと、あの長すぎるって怒られるんすよ。\n[00:08:31] 辻: なるほど。\n[00:08:32] 説明者: そうなんすよ。そういう仕様も入ってるっていう、いやらしいんすよね。だから内部的に多分持ってんだと思うんですけど、その、その多分上から多分足してくんでしょうね、こうトントンピッピピって。足した時に多分桁数を超えるんで、あのキャパオーバーです、みたいな感じなんだと思うんですけど。\n[00:08:53] 説明者: ま、そういうのもちょっと前ちょっと課題として上がってて、多分、このなんだっけ、バックログか、そこにも書いた記憶はあるんですけどね。ま、そういう状況でございます。ま、ちょっと余談でしたという感じですね。はい。\n[00:09:07] 説明者: 終わりました。\n[00:09:09] 説明者: じゃあ、ちょっと申し訳ないですけど、辻さんとりあえずは粛々とテストをよろしくお願いしますと。で、俺も粛々とあのテスト設計頑張りますって感じなので。はい。\n[00:09:17] 辻: はい。\n[00:09:19] 説明者: はい。じゃあ、ちょっと早いけど以上で終わろうかと思いますので、はい、じゃあすいません、引き続きよろしくお願いいたします。じゃあお疲れ様でした。\n[00:09:25] 辻: ありがとうございました。\n[00:09:27] 説明者: ありがとうござい。\n[00:09:27] 辻: 失礼します。\n[00:09:28] 説明者: 失礼します。",
  "meeting_notes": "# 会議議事録\n\n## エグゼクティブサマリー\n- **日時**: 2025/10/16 08:34\n- **参加者**: 説明者、辻\n- **主要議題**: 新AWSサーバーのHTTPS化、パス長問題への対応、Dr. Samurai関連のテスト設計進捗、本番環境でのトリマス関連確認、JobCenter運用設計上の課題と制約。\n- **重要決定事項**:\n    1. 新AWSサーバーのHTTPからHTTPS変換完了後、関係者へ周知すること。\n    2. 本番環境でのメール件名に「Dev」が記載されている件は、現状維持で運用継続とすること。\n    3. 辻は本番環境でのトリマスの値（名前、住所、代表者名）の変更を簡易的に確認すること。\n\n## 主要な議題・トピック\n1.  **新AWSサーバーのHTTPS化と関係者への周知**\n    -   **内容**: 新AWSサーバーにおいて、HTTPからHTTPSへの変換が実施される予定。変換完了後、関係者への周知が必要となる。\n    -   **決定事項**: HTTPS変換完了後、関係者へ周知する。\n    -   **重要なポイント**: 変換作業の進捗状況を関係者が把握できるよう、適切なタイミングでの情報共有が求められる。\n\n2.  **パス長問題に関するサポートへの質問対応**\n    -   **内容**: 以前より懸念されていたパス長（またはエラーメッセージの長さ）に関する問題について、サポートへの質問が送信された。質問内容は、3環境での対応、IDの重複問題、および標準的な運用方法について。説明者が送信ボタンを押し忘れていたため、質問送信が遅延していた。\n    -   **決定事項**: サポートへの質問は昨日（会議前日）急遽送信済み。回答を待つ。\n    -   **重要なポイント**: パス長問題はシステム運用に影響を及ぼす可能性があるため、サポートからの回答内容と今後の対応方針が重要となる。\n\n3.  **Dr. Samurai関連のテスト設計進捗とレビュー依頼の可能性**\n    -   **内容**: Dr. Samurai関連のテスト設計が遅れていたが、現在作業を再開し着手している。Dr. Samuraiシステムの構造は複雑であり、設計に不安があるため、作成したフロー図の辻による確認依頼の可能性がある。\n    -   **決定事項**: 説明者はDr. Samurai関連のテスト設計を引き続き作成する。必要に応じて辻にレビューを依頼する可能性がある。\n    -   **重要なポイント**: 複雑なシステムのテスト設計であり、他者による確認を通じて設計の網羅性と正確性を確保することが重要。\n\n4.  **本番環境でのトリマス関連の確認とメール件名「Dev」表記の扱いの決定**\n    -   **内容**: 本番環境での確認作業を開始し、トリマスのコピー機能に関するテストを実施。この過程で発生したエラーメールの件名に「Dev」という表記が含まれていることについて、辻に確認があった。「Dev」表記を残すか否かについて議論され、現状維持が決定された。\n    -   **決定事項**: 本番環境でのメール件名に「Dev」が記載されている件は、現状維持で運用継続とする。今更変更すると大惨事になるリスクがあるため。\n    -   **重要なポイント**: システム運用における表記の一貫性や変更のリスクを考慮した判断。\n\n5.  **トリマスの値変更の簡易確認依頼**\n    -   **内容**: テスト設計に記載されていたトリマスの値（名前、住所、代表者名など）が正しく変更されているかの確認を辻に依頼。簡易的な確認で問題ないとのこと。\n    -   **決定事項**: 辻は本番環境でのトリマスの値（名前、住所、代表者名）の変更を簡単に確認する。\n    -   **重要なポイント**: 重要なデータ項目の変更が正しく反映されていることを早期に確認し、潜在的な問題を特定する。\n\n6.  **JobCenter運用設計上の課題と既存JMSとの比較**\n    -   **内容**: 運用設計について検討中。既存のJMSに慣れている説明者にとって、JobCenterの仕様がJMSと比較して柔軟性に欠け、使いづらいと感じている。特に、JobCenterはJMSが持っていた融通が利く機能を切り捨てている印象があり、1月以降「壊れている」と感じる部分もあるとのこと。また、ファイル名や処理名の命名規則についても、既存の命名方法では処理内容が分かりづらいという課題が提起された。\n    -   **決定事項**: なし（懸念事項の共有に留まる）。\n    -   **重要なポイント**: JobCenterへの移行や運用において、既存システムとの差異が運用効率や保守性に与える影響が大きい。課題解決のための検討が必要。\n\n7.  **エラー処理登録名と名前の長さの制約に関する課題**\n    -   **内容**: JobCenterではエラー処理の登録名が重複できない仕様であり、区別するために工夫が必要。さらに、処理名自体にも長さの制約があり、特に処理が多段階で深くネストしている場合に、名前が長くなりすぎるとシステムに拒否されるという問題がある。これは内部的に文字列の連結が行われ、桁数オーバーとなるためと推測される。\n    -   **決定事項**: なし（既存の課題として共有）。\n    -   **重要なポイント**: システムの命名規則や処理の構造化において、これらの制約を考慮した設計が不可欠となる。\n\n## ユーザーの主要なアクション項目・コミットメント\n- **説明者**: 新AWSサーバーのHTTPからHTTPS変換完了後、関係者へ周知する。- **期限**: 随時\n- **説明者**: Dr. Samurai関連のテスト設計を引き続き作成する。- **期限**: 継続\n- **辻**: 本番環境でのトリマスの値（名前、住所、代表者名）の変更を簡単に確認する。- **期限**: 随時\n- **説明者**: JobCenterの運用設計に関する課題解決策を検討する。- **期限**: 継続\n- **説明者、辻**: 粛々と各自のテスト作業を継続する。- **期限**: 継続\n\n## 決定事項サマリー\n- 新AWSサーバーのHTTPS変換完了後、関係者へ周知する。\n- パス長問題に関するサポートへの質問は送信済みであり、回答を待つ。\n- 本番環境でのメール件名に「Dev」が記載されている件は、現状維持で運用継続とする。\n- 辻は本番環境でのトリマスの値（名前、住所、代表者名）の変更を簡易的に確認する。\n\n## 次回までの課題・懸念事項\n- JobCenterの仕様が既存JMSに比べ柔軟性に欠け、運用面での不便さがある。\n- JobCenterの信頼性に対する懸念（1月以降の動作不具合）。\n- JobCenterにおける処理名が長く、また重複不可であることによる命名規則の難しさ。\n- JobCenterで深い処理を行う際、処理名の長さ制限により登録できない問題。\n\n## 備考・その他の重要な情報\n- 説明者はテスト設計作業が遅延していたが、現在改めて着手を開始している。\n- 会議は予定より早めに終了。\n- 相互の協力体制（説明者はテスト設計、辻はテスト実行）でプロジェクトを推進する。",
  "meeting_date": "2025-10-16T08:34",
  "conditions": "",
  "timestamp": "2025-10-16T08:36:17.138570",
  "file_size": 3430944
}